[{"url":"https://www.ucl.ac.uk/careers","service_name":"UCL Careers","category":"Careers","description":"UCL Careers Our team of experienced career professionals are dedicated to supporting all current UCL students,   (staff and students), and recent  to help you find the right path to ensure success in your future career.  Access guidance on career choices, sector information and other routes. •    Find out what our graduates do •    Explore occupations and job sectors •    Study, working for yourself and more! Find relevant opportunities if you know what you're looking for.  •    Work opportunities and volunteering •    Research and further study •    Funding and competitions We support you throughout the entire application process.  •    Developing your skills •    Writing CVs and applications •    Interview skills & assessment centres     Designed to help you navigate career support available to you at UCL, so you can find the right path, and success in your future career. Don’t miss out on the latest careers and employability news, features, opportunities, and events. Delivered strai","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:18:03.493830+00:00","last_modified":"Fri, 24 Oct 2025 04:26:27 GMT"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/","service_name":"UCL Careers","category":"Careers","description":"UCL Careers Our team of experienced career professionals are dedicated to supporting all current UCL students, (staff and students), and recent to help you find the right path to ensure success in your future career. Access guidance on career choices, sector information and other routes. •    Find out what our graduates do •    Explore occupations and job sectors •    Study, working for yourself and more! Find relevant opportunities if you know what you're looking for. •    Work opportunities and volunteering •    Research and further study •    Funding and competitions We support you throughout the entire application process. •    Developing your skills •    Writing CVs and applications •    Interview skills & assessment centres Designed to help you navigate career support available to you at UCL, so you can find the right path, and success in your future career. Don’t miss out on the latest careers and employability news, features, opportunities, and events. Delivered straight to you","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:40.655899+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/about-us","service_name":"About us","category":"Careers","description":"UCL Careers UCL Careers is connected to more than 1,000 employers in the UK and around the world. Recruiters and employers visit our campus throughout the year to participate in a range of careers events and activities. We have extensive available online plus an and, you can sign up for our so that you’ll be the first to know about new opportunities and events. You can visit us at our and talk to our team about anything to do with next steps and how to get there. You can also get more tailored advice in a one-to-one or come along to one of the many recruitment / networking focussed or skill development that we run throughout the year. If you’re using UCL Careers for the first time, our and are useful tools to help you discover which of our services are most relevant to you or, you can ' ' at any time to find out more about how we can support you. (Our will provide further details on who has access to our services and our provides more detail on what you can expect as a user of UCL Care","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:53.167825+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/about-us/contact-us","service_name":"Contact us","category":"Careers","description":"UCL Careers 3rd Floor, 40 Bernard Street, London, WC1N 1LE Monday - Friday: 10am - 4pm ( ) / Monday - Wednesday: 10am - 4pm (During ) All UCL students and can also contact us at any time by submitting your enquiries through . UCL Careers is closed at weekends, Bank Holidays and all . Other planned closures will be advertised on our . *Use the to find our location or for detailed directions / approximate journey times from other UCL buildings / nearby tube stations etc. Please also be aware that this building does not have an evacuation chair or operational fire protected lift so, safe evacuation might not be possible in all cases for those unable to use the stairs. If you have any special evacuation needs, please state these ahead of your visit or upon arrival at the very latest. If you are a recruiter who is targetting UCL students / graduates with specific opportunities or would like to use your industry expertise to help develop key employability skills / commercial awareness throug","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:06.681421+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/about-us/diversity-and-inclusion-student-programmes","service_name":"Diversity and Inclusion Student Programmes","category":"Careers","description":"UCL Careers Links to organisations running programmes aimed at students from BAME backgrounds, plus guidance on equality, diversity and inclusion in recruitment processes once you are in employment. Enhanced careers support for UCL undergraduates from under-represented groups. It is open to UK undergraduates (home fee status) from a range of backgrounds (such as being the first generation in family to attend university or a lower-income household).","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:55.778572+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/about-us/get-one-one-advice","service_name":"Get one-to-one advice","category":"Careers","description":"UCL Careers Whether you're unsure about your future options or have something specific in mind to discuss, this type of appointment is an excellent place to get some professional advice and can be used as a starting point for discussing a wide range of topics with one of our Careers Consultants. It is incredibly important to ensure your applications make a positive impact at every stage of your application to a job. This appointment is aimed at those who have drafted an application, (CV, cover letter, personal statement etc.), for something specific and want advice on how to improve it before sending it off. If you've been invited to a live or recorded video interview, this role-play style appointment will aim to simulate the experience of the real thing to help you better understand the process and improve your interview technique. It's also an excellent opportunity to highlight and fix any software or connectively issues before heading into the real thing. If you haven't been able to","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:04.060152+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/about-us/upcoming-events","service_name":"Upcoming events","category":"Careers","description":"UCL Careers Below you can find a small selection of featured events. that you are eligible to book onto, you will need to log into myUCLCareers to view our and book a place for anything you'd like to attend. Through myUCLCareers, you can also to subscribe to receive event alerts and be the first to know when new events are available to book. Please enable JavaScript to use this page or","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:01.846981+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/about-us/who-we-work","service_name":"Who we work with","category":"Careers","description":"UCL Careers See our for guidance on who we work with.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:57.073265+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/about/awards","service_name":"Awards and Professional Accreditation","category":"Careers","description":"UCL Careers The Association of Graduate Careers Advisory Services, ( ), is the professional association for higher education (HE) careers practitioners and those involved in the provision of careers and employability education, information, advice and guidance to current or prospective HE students and graduates. UCL Careers is a full of this association. UCL Careers picked up the AGCAS award for Careers Service/Academic Department Partnership award for the work with UCL Management Science & Innovation, Engineering Faculty and Laws Faculty. is a national quality accreditation system specifically for information, Advice and Guidance Services. The Matrix standard relates to how the service provided is advertised, defined and delivered and clients supported and also to how the service is managed, resourced and how it responds to feedback from users and ensures continuous quality improvement. Accreditation is only granted as a result of a rigorous on-site inspection in which discussions wit","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:00.711237+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/about/eligibility","service_name":"Who can use our services","category":"Careers","description":"UCL Careers UCL Careers is dedicated to providing support for current UCL students and researchers, (both staff and students), and to recent UCL graduates as outlined below. When attending on campus appointments / events or visiting UCL Careers, you will be asked to provide your UCL ID card which is issued / can be replaced by . (Recent graduates who no longer have this can also provide proof of enrolment dates with a ). * who work closely with students on areas linked with employability will have a dedicated contact within UCL Careers who can help support your activities and ensure your students make the most out of the careers support available at UCL. Please check our for information on those aligned with your department or if unsure so we can pass on your details to the relevant member of our team. or other organisations targeting the groups above should visit our for more information on how we can support your needs. (*Note: , (academic and non-academic / professional services sta","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:07.600441+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/about/feedback","service_name":"Tell us what you think","category":"Careers","description":"UCL Careers At UCL Careers, we aim to constantly monitor the effectiveness of everything we offer for the benefit of all of our users. If you've made use of any of our resources or services, please do tell us what you think of them so we can continue providing more of what you find useful or work to improve other areas where necessary. For any appointment or event booked through your myUCLCareers account, after attending, you will automatically be sent a feedback request form and we would encourage you to fill this in. It will simply ask whether it was useful or not and give you the opportunity to provide additional comments should you wish to. It can take as little as 30 seconds to complete and all feedback is valuable to us so please do click the link when you get the email. We'd also love to hear from you if you have any general thoughts on the different ways that UCL Careers currently supports you or could support you better in future. If you have any praise, comments, suggestions","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:58.484281+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/about/news","service_name":"News","category":"Careers","description":"UCL Careers (*Login required for current students and recent graduates). Sign-up to the to stay informed of our upcoming news, opportunities and events by logging in to myUCLCareers.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:05.574947+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/about/privacy-notice","service_name":"Privacy notice","category":"Careers","description":"UCL Careers We use the data in myUCLCareers to manage your use of Careers’ services and facilities. In particular, we also use it to: We also share information about use of UCL Careers and the destinations of graduates with academic departments. This information supports departments to improve the employability of their graduates to promote their programmes to prospective students. Through your myUCLCareers account you can also elect to receive more regular communications by providing additional information (like your preferred job types and industry sectors). The communications you can choose to receive are: Your personal data and information on your engagement with UCL Careers services will be held on myUCLCareers for five years following your completion date. Any other personal data held on file (such as through focus group participation) will be deleted within five years of your completion date. Please be aware UCL Careers does maintain partnerships with some external organisations","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:59.290100+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/applying/applications","service_name":"Writing applications","category":"Careers","description":"UCL Careers Whether you're drafting a CV, cover letter, motivation statement or any other type of application, there is a lot of support available to help you. Whether you're applying for a job or internship, a work experience or shadowing opportunity (including speculative applications), a volunteering project, a further study or postgraduate course, a PhD or postdoctoral research post, a scholarship or other funding opportunity or anything else, there is a lot of support available to help you write your application, (CV, cover letter, personal statement etc). Explore our CVs, Cover Letters and Applications 'Pathway' - a series of activities that you can work through in your own time to help you learn more about the process of putting together successful applications. Our range of include top tips and examples and cover different formats of application such as: UCL Careers provides students* with free access to VMock - an online tool which can provide immediate tips and advice on how","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:40.002225+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/applying/assessment-centres","service_name":"Assessment centres","category":"Careers","description":"UCL Careers Our UCL guides include top tips and examples: You can also browse a broad range of informative articles from TARGETjobs. Search for key words such as This resource provides example assessment centre exercises, as well as assessor information guides to help candidates to prepare for typical assessment centre exercises. At UCL Careers we partner with this test provider to save you having to pay for these yourself. You simply need to register* via the links below. The exercises included are: *Note: To register to access the test materials for free, you will need a UCL email address. Recent Graduates should read the information about 'Email for Life' on the website for details on accessing your UCL email account after graduation. The holds several books that you can borrow which cover typical graduate level assessment centre exercises and provide tips on preparation and how to stand out. The books available cover a wide range of AC scenarios commonly used by graduate recruiters","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:35.734647+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/applying/interviews","service_name":"Interview skills","category":"Careers","description":"UCL Careers Access these modular, video-based, interactive Interviews courses: Our UCL guides include top tips and examples: This resource can be used for interview preparation. The website includes a 'Question Identifier Tool' which allows you to answer a series of questions about a job description/specification and their tool identifies the types of questions that are likely to come up at interview. It also has a facility to practice and record video interviews, which includes feedback on your facial expression and provides possible answers and approaches to common interview questions. You can choose to practice questions based on competency, skills or case study interviews, sector, or even company-specific interviews (based on knowledge of around 40 graduate employers recruitment processes). At UCL Careers we partner with this test provider to save you having to pay for these yourself. You simply need to register* via the links below. Simply register using your UCL email address end","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:37.204189+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/applying/psychometric-tests","service_name":"Psychometric and aptitude tests","category":"Careers","description":"UCL Careers Graduate recruiters often use a wide range of selection tests, (aptitude / psychometric tests), to assess specific skills as part of their recruitment process and we can help you to prepare for these. Our UCL guides include top tips and practice tests: You can also browse a broad range of informative articles from TARGETjobs. Search for key words such Although many of the sites / resources suggested above will provide access to free sample tests / questions, some will also give the option of purchasing tests which give access to additional questions and more detailed feedback. At UCL Careers we partner with two major test providers to save you having to pay for these yourself. You simply need to register* via the links below to access any tests that are relevant to you. The free tests you have access to include: The free tests you have access to include: *Note: To register to access the test materials for free, you will need a UCL email address. Recent Graduates should read","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:37.908432+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/explore-your-options/know-yourself","service_name":"Know yourself","category":"Careers","description":"UCL Careers Have you ever wondered what makes you the person you are? Personality profiling can help you discover how you can work better in teams and communicate effectively. This is a useful life skill and will help during group discussions and assessment days, which many employers use in their recruitment processes. At UCL Careers, we use the MyersBriggs Type Indicator (MBTI) profiling tool. You will gain insight into your own personality and how you may differ from others. This can help you work more effectively in a team and will be useful if you are considering leadership roles in the future. Understanding the similarities and differences between yourself and others will help you to interact positively in group discussions, which are often used during employer assessment days as part of the recruitment process. Personality profiling workshops can also help you to identify the types of work and working environments that you may enjoy. All MBTI events must be booked through your my","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:26.266600+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/exploring-your-options","service_name":"Exploring your options","category":"Careers","description":"UCL Careers Some people know exactly what they want to do from an early age. Others haven't got clue! Whether you look at the options that are available to you, by exploring the and that exist in different sectors and industries. By researching your options, you will be in a better position to - and UCL Careers is here to help you. Access 'graduate outcomes' data to discover what UCL Alumni from different degree programmes have gone on to do and explore the wider range of options on next steps for graduates based on degree disciplines and / or levels of qualification. If you are aiming to work post-graduation and have some ideas in mind alread, you can explore: •    Labour markets and sector information •    Different roles and the skills required If moving straight into work post-graduation is not your plan, explore other options including: •    Further study and research •    Working for yourself or outside the UK","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:19.613968+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/exploring-your-options/explore-opportunities","service_name":"Explore opportunities","category":"Careers","description":"UCL Careers If you're thinking about taking on further study after your degree, then use this information to help you. We provide one-to-one support and extensive programme of events for the UCL research community. Whether you want to develop a business idea or just learn more about self employment, there is a lot of support available to you. Taking a gap year, either for self fulfilment or career development, can reap rewards. Advice and guidance on connecting you to the opportunities you want overseas. On-line guidance for information about UK immigration and visas. Whether you're a student or graduate, UCL alumni can help you make the most out of your career journey. The team is available to support you as a UCL graduate through learning events, networking opportunities and connections to UCL.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:22.167713+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/exploring-your-options/occupations-and-job-sectors","service_name":"Occupations and job sectors","category":"Careers","description":"UCL Careers Listed below are a range of websites and information that you can delve into to understand what job best suits you. Take time to explore different roles and the skills required for them. Whether you don't yet know what life holds post-graduation and want to explore the wide range of career options open to you, or you may have some ideas in mind and want to find out more about these - there is a lot of support available to help you. If you are considering your options after graduation, provides information and resources designed to help you. Our UCL guides include: Career Discovery also includes a broad range of informative articles from targetjobs. Search for key words such as ' ', and ' ' to view a full list of resources. We organise a wide range of events where you can find out more about more about options and opportunities for graduates in a variety of different industry sectors. If you are in the process of discovering what career path you might wish to take, you can b","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:23.314075+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/find-opportunities/further-study","service_name":"Further study","category":"Careers","description":"UCL Careers Find powerful tools to get you get started when searching for postgraduate study courses. See what tools and resources you can use to find study opportunities overseas. Many organisations will attend or run recruitment focused events to promote current vacancies in person which will give you the chance to get answers to questions that you may not find on job boards or recruitment websites. Through a 'short guidance' appointment, you can meet one of our Careers Consultants to discuss where you've been looking so far, explore other avenues and get more tailored tips and advice on improving your own personal job search.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:29.660263+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/finding-opportunities/work-opportunities","service_name":"Work opportunities","category":"Careers","description":"UCL Careers Employers actively targetting UCL students, recent graduates and researchers will post current opportunities here. Find out more about searching our opportunity listings / company database and registering for job alerts. Find out more about other UCL-hosted job boards which also promote opportunities aimed at current students or provide job listings for those who are looking to work at UCL, (HR, Students' Union UCL, Unitemps etc.). Guides on the practical side of job hunting that will help you through the process of looking for work in the most appropriate way and suggest alternatives for more niche, industry-focused sites hosted by external organisations. Job hunting carries certain risks which you need to be aware of and take precautions against, in order to stay safe. If you're looking for work experience that you can carry out remotely, simulated work experience opportunities can help you get an insight into what it would be like working in specific sectors and companie","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:31.160605+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/finding-your-next-opportunity","service_name":"Finding your next opportunity","category":"Careers","description":"UCL Careers More information on finding internships, graduate vacancies, part-time jobs or other work opportunities. If you're looking for PhD, post-doctoral or other research positions, here are some suggestions of where to look. If you are planning further study after your current degree, here's where to look for opportunities. If you're looking for financial support for work opportunities, further study or research, there's lots of support available. To develop skills and experience through unpaid work experience/shadowing, here are some useful tips. Get involved with a range of business challenges or competitions led by recruiters to help develop key skills.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:17.235959+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/opportunities/funding","service_name":"Funding","category":"Careers","description":"UCL Careers Offers a range of online information and resources about student finance, funding and support including access to the . They also provide one-to-one appointments with a Student Funding Welfare Adviser who can give advice on the hardship fund, access to learning fund, student loans company funding, loans, bursaries and more. Our Career Essentials programme, (repeated throughout the year), is a series of Careers Consultant led talks aimed at all students and recent graduates which includes a session on finding and funding a PhD. Through our career conversation appointments, you can meet with one of our careers consultants to discuss where you've been looking so far, explore other avenues and get more tailored tips and advice on searching for relevant funding opportunities. Students' Union UCL Rights & Advice also offer one-to-one appointments with student advisers where you can discuss financial support while studying.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:27.483284+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/opportunities/research","service_name":"Research","category":"Careers","description":"UCL Careers Whether you want to find PhD opportunities or are a researcher looking for postdoctoral or other research opportunities, there is dedicated support available. To get you started, there are a number of useful resources provided which will help make your search for a research position a success. This is the main site that employers and PhD providers are encouraged to use when recruiting UCL students, recent graduates and research staff. There will also be opportunities specifically aimed at PhDs and postdocs advertised, which have been proactively sourced by the UCL Careers team. Our exclusive shortlisting service is designed to put you directly in touch with small-to-medium sized organisations - we have set up a shortlisting service connecting UCL PhD researchers and postdocs with opportunities in organisations in a range of industries. We actively source relevant opportunities for potential UCL candidates and present shortlisted applications to employers. If you're looking","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:28.190632+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/opportunities/volunteering","service_name":"Volunteering","category":"Careers","description":"UCL Careers Browse projects available through the Volunteering Service – part of Students' Union UCL – and make a real difference!","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:20.743005+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/options/events","service_name":"Come to an event","category":"Careers","description":"UCL Careers We organise / host a wide range of events and workshops which can be delivered by members of the UCL Careers team, UCL alumni or by employers / speakers from other external professional organisations. Our employer events are opportunities for all students to access information about careers/employment that appeals to them. UCL Careers is here to support all students, and our events aim to enable students to discuss their futures with as wide a range of employers as possible. Please be reminded that all students attending our events are expected to comply with UCL’s , which includes a requirement to behave in a respectful manner towards others. Disrupting events, or exhibiting disruptive or disrespectful behaviour towards other students or attendees, will not be tolerated and may lead to disciplinary action being taken. Please refer to our for more information.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:02.942045+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/options/job-hunting","service_name":"How to search for a job","category":"Careers","description":"UCL Careers Are you uncertain about what sort of job might suit you? Most people explore the world of work and their options before they find the best fit for their skills, preferences, values and personality. You can get a better idea of what suits you - as well as a better understanding of the job opportunities available - through placements, internships and voluntary work. You may find it useful to browse job opportunities online and to come to career events where you can meet employers and learn more about specific sectors, industries and organisations. To make sure you get the best opportunities and make the most of them, UCL Careers offers these top tips:","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:24.579348+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/preparing-apply/developing-your-employability-skills-ucl","service_name":"Developing your employability skills at UCL","category":"Careers","description":"UCL Careers (scroll using arrow keys) Explore the seven elements of the Pillars of Employability (below) to learn more about what employability means and how you can develop your skills. There are five Pillars, one base and one roof - these are your seven elements: Everything is underpinned by a foundation of key transferable skills These represent the key learning you can gain during your time at UCL. You can ‘Deepen your knowledge’, ‘Innovate and Create’, ‘Make a social and global impact’, Explore your values’ and ‘Gain experience and networks’. The text under each Pillar signposts the skills and experience you’ll want to consider to develop these areas. This encourages you to reflect upon and articulate these skills and experiences, to bring your learning together, celebrate progress and support you in setting future goals. Not sure where to start? Immerse yourself in intellectually stimulating, research intensive and academically rigorous education. Show curiosity by exploring idea","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:34.242453+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/preparing-apply/skills-hub","service_name":"Skills Hub","category":"Careers","description":"UCL Careers The ability to communicate, interact and build relationships with others.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:32.919638+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/preparing-your-application","service_name":"Preparing for your application","category":"Careers","description":"UCL Careers For any type of application, (CV, cover letter, application form, personal statement, research proposal etc.), find out more on how to effectively structure your application based on a particular recruiter's requirements. If you have been invited to any type of interview, whether a one-to-one meeting, panel, phone, video or Skype interview, we can help you better understand the process and get yourself prepared. We provide information on a range of selection aptitude tests (numerical, verbal, logical reasoning, situational judgement, e-tray) and access to practice questions plus additional support where needed. If you're likely to need to attend an assessment centre for the type of roles you're applying for, we can help you understand more about them and develop key skills that recruiters will be assessing. The Pillars of Employability explains the learning you can undertake and the unique opportunities you can leverage at UCL to prepare for your future.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:17.127868+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/resources","service_name":"Resources","category":"Careers","description":"UCL Careers If you have any questions or suggestions about any of our resources or just need help with finding what you're looking for, simply .","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:51.783845+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/resources/Departmental","service_name":"Departmental","category":"Careers","description":"UCL Careers Many UCL departments will provide information about alumni, links with professional associations and typical career paths in the information they provide for prospective students. You can find this by specific degree programme or by subject area using the . The provides information about full or part-time undergraduate courses aimed at prospective students. This includes data for specific courses at UCL, including employment and destinations, student satisfaction and entry requirements. It also allows you to compare course data for different institutions. also provide useful tips and advice for those considering studying at undergraduate level. Your school, college or other current educational institution may also have support available on University options. More general information on the Graduate Labour Market and employment trends for graduates or non-graduates is also published by the and , (the Higher Education Careers Services Unit).","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:12.045184+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/resources/blog-posts-and-case-studies","service_name":"Blog posts and case studies","category":"Careers","description":"UCL Careers Please enable JavaScript to use this page or","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:08.949408+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/resources/case-studies","service_name":"Case studies","category":"Careers","description":"Service details available on website.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:10.819913+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/resources/directory","service_name":"A-Z Directory","category":"Careers","description":"UCL Careers Not sure where to start?\nThis A-Z Directory of common terms will link you straight to the most relevant content on our site. No listings for H No listings for 'K' No listings for Q No listings for 'X' No listings for 'Y' No listings for 'Z'","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:14.835937+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/resources/information","service_name":"Online careers resources library","category":"Careers","description":"UCL Careers A huge range of information resources designed to help you explore / research different options and find practical tips on topics including networking, writing CVs / applications and interview prep. (alumni profile) (alumni profile) If you have any feedback or suggestions about content you'd like to see then please let us know through The holds several careers books that you can borrow to read in your own time. Books available cover CVs, interview and case interview tips, preparing for assessment centres, and psychometric tests including commonly used tests such as numerical/verbal reasoning plus a wide range of other professional level selection tests. Loans are available for 1 week. Visit the to view titles available.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:09:13.370550+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/resources/themed-weeks-archive","service_name":"Themed Weeks Archive","category":"Careers","description":"UCL Careers Interested in a career that makes a difference? See our archive of events from those working at the heart of government. Considering a career in Arts, Museums or Cultural Heritage? See our archive of professionals working in various roles within these sectors. Gain tips on routes into the media industry from experienced professionals and learn what you can start doing now to increase your chances of success! Want to work for charities and not for profits? See our archive of insights from professionals, and discover what jobs you can do and where to start. More employers are looking for students with sustainability skills. In our archive, you can explore the breadth of opportunities in this sector, introducing you to leading organisations. Understand the broad range of career options available to you in health. From data to diagnostics and research to treatment. Sustainability archive reveal the breadth of opportunities in this rapidly growing sector and introduces you to le","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:54.439971+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/ucl-staff","service_name":"UCL Staff","category":"Careers","description":"Service details available on website.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:06:52.898089+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/ucl-staff/embedding-employability-ucl","service_name":"Embedding employability at UCL","category":"Careers","description":"UCL Careers In 2024, UCL refreshed the Pillars of Employability (2020), its institutional definition of employability. (scroll using arrow keys) The Pillars framework has been refreshed by the to encompass the broader scope of future-focussed education as defined in . It is designed to support UCL students to take on key learning to prepare them for the future, whatever that might look like for them. This refresh incorporated: This refresh was endorsed by the UCL Education Committee in December 2024. The supporting paper is . Advance HE in their recognise that the first step in embedding employability is to have an institutional definition which includes all stakeholders; is explicit at an institutional and programme level and is shared with students. Having an institutional point of reference means it is then possible to put in place. The framework gives a starting point for discussion and reflection on your programme/course. Each UCL course will have a different take on each element","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:03.966445+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/careers/ucl-staff/meet-team-ucl-careers","service_name":"Meet the team: UCL Careers","category":"Careers","description":"UCL Careers Contact details and team information for UCL Careers. If you looking for support or collaboration in working with UCL Alumni, please contact the in the first instance. *If you're unable to find a specific contact related to your Department / Faculty or topic of your enquiry from the links above, our central enquiries team can forward emails on to the most relevant person in the UCL Careers team for you.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:06:55.480385+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/academic-support","service_name":"Academic support","category":"Support","description":"Students Questions? Get off to a good start at UCL and identify your development goals to make the most of university. Build on first-year learning, consolidate knowledge and make the most of UCL's offer. Succeed in your final-year project or dissertation and prepare for your next steps. Gear up for postgraduate study, develop the skills you need and find out what UCL has to offer. Information from the Doctoral School to develop your research, transferable and professional skills during your research degree. Find out about a range of support at UCL for students from particular groups, including parents, carers, international students and BAME students.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:32.695951+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/academic-support/digital-education-ucl-0","service_name":"Digital education at UCL","category":"Support","description":"Students Questions? At UCL, our approach to learning and looks at how you can become a successful Connected Learner. Have you tackled the challenge of learning online? Here’s our advice on getting organised and taking control of your time. To be an effective online learner you need to do more than just listen, read and watch, you’ll need to participate as well. Asynchronous materials are learning resources provided for you to use or complete at a time that suits you.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:35.223180+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/academic-support/final-year-undergraduate","service_name":"Final-year undergraduate","category":"Support","description":"Students Six things to think about for your final-year project. Support and resources to help you tackle your assignments. Build on your digital skills to help with your studies and prepare for your future. Tips, advice, and opportunities for academic skills development. Get involved with some of the other opportunities at UCL to develop your skills. Prepare for your next steps, wherever they might take you. Make sure you look after your health and wellbeing, and access the correct support. A huge thank you to Loizos Lambis, a final-year undergraduate student, for helping curate the content for final-year undergraduates. Got feedback or suggestions for resources? Would you like to create some content to help other students? in the UCL Arena Centre. We are also keen to hear from staff if you have comments or suggestions.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:43.113485+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/academic-support/first-year-undergraduate","service_name":"First-year undergraduate","category":"Support","description":"Students How you will learn at university. Simple steps to help you tackle your first assignment. Tips, advice, and opportunities for academic skills development Find out about the other opportunities to develop your skills at UCL. Module choice, careers and planning your summer early. A huge thank you to Lily Weilar, a second-year undergraduate student, for helping curate this content. Got feedback or suggestions for resources? Would you like to create some content to help other students transition to university and make the most of their first year? . We are also keen to hear from staff if you have comments or suggestions.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:44.955244+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/academic-support/personal-academic-tutors","service_name":"Personal Academic Tutors","category":"Support","description":"Students One of your first priorities should be to meet your Personal Academic Tutor. They will help you to get the most out of your studies, and provide support and encouragement during your time with us. From settling into university life to planning your career after graduation, the relationship you build with your Personal Academic Tutor will play a large part in the success you achieve.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:36.497469+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/academic-support/postgraduate-research","service_name":"Postgraduate research","category":"Support","description":"Students Information to help you get off to a good start at UCL. Information, advice, workshops and events to support your world-class doctoral training. Expand your skills to support your research, professional development and employability. Where to get support for your academic writing at UCL. Information, advice and training to develop your skills and support your research needs. Development pathways for postgraduate students who teach at UCL. Find out about the other opportunities to develop your skills at UCL. Prepare for the next steps after your research degree with dedicated support. A huge thank you to Abdur Hashmi, a postgraduate research student in Electronic and Electrical Engineering, for helping curate the content for research students. Got feedback or suggestions for resources? Would you like to create some content to help other students? in the UCL Arena Centre. We are also keen to hear from staff if you have comments or suggestions.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:40.749382+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/academic-support/postgraduate-taught","service_name":"Postgraduate taught","category":"Support","description":"Students For many, stepping up to postgraduate study can be challenging, not least because you need to get up and running a lot quicker than at undergraduate level. These resources will help you find the support you need, build on your skills and help you make the most of the opportunities at UCL to prepare for your next steps. Essential information to help you prepare for your Master's. Information to help you get off to a good start at UCL. Where to get support for your writing and dissertation. Tips, advice, and opportunities for academic skills development. Get careers support and look for wider development opportunities at UCL. Find out about the other opportunities to develop your skills at UCL A huge thank you to Remina Aleksieva, a postgraduate taught student in Political Science, for helping curate the content for Master's students. : UCL's student enquiry system. Your one-stop shop to ask any questions that you have, which will correctly get directed to the correct team to an","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:41.401110+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/academic-support/second-year-undergraduate","service_name":"Second-year undergraduate","category":"Support","description":"Students Find out what's different about Year 2 and how you will learn in 2021/22. Tips for success from previous second-year UCL students. Tips, advice, and opportunities for academic skills development. Support and resources to help you tackle your assignments and exams. Get involved with some of the other opportunities at UCL to develop your skills. Find out about the range of opporutnites to go abroad as a UCL undergraduate student. Careers, summer plans and thinking ahead to final year. Make sure you look after your health and wellbeing, and access the correct support. A huge thank you to Lily Weilar, a second-year undergraduate student, for helping curate this content. Got feedback or suggestions for resources? Would you like to create some content to help other students perform at their best as they move into second year? in the UCL Arena Centre. We are also keen to hear from staff if you have comments or suggestions.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:43.528400+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/careers-and-work-experience","service_name":"Careers and work experience","category":"Careers","description":"Students Questions? We provide a wide variety of careers information, one-to-one guidance and events to support you at all stages of your career during and after your time at UCL. Workshops, panel discussions and one-to-one coaching sessions exploring what recruiters are looking for and how to develop and promote your skills more effectively. Events to help improve your knowledge of a particular industry sector or about specific employers as well as talks and workshops to help you develop key skills. Events, competitions and support from UCL Innovation and Enterprise to help you get ready for turning your entrepreneurial ideas into business success. Volunteering can be a great way to learn new skills and improve your career options after studying is over. Open to all incoming Masters students, this short online course aims to provide you with the essentials tools for planning for your future.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:31.233630+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/new-students/transition-mentor-programme","service_name":"Transition Mentor Programme","category":"Support","description":"Students Information for who are interested in being a Transition Mentor Information for who are starting at UCL in Autumn 2024 Find out about Transition Mentor Programme news, events and updates All undergraduate academic departments work with the Transition Team to deliver their local transition programme. Academic departments are responsible for booking and coordinating Meet Your Mentor sessions during enrolment week. Departments can also run their own additional local induction activities, in addition to the Transition programme. If you are a member of staff that would like to receive more information, please contact the Transition Team by emailing","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:39.277889+00:00"},{"url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services","service_name":"Support and Wellbeing Services","category":"Support","description":"Students   Access our support and resources to address any academic and wellbeing concerns you may have. Information and advice on managing any mental health or wellbeing difficulties impacting your ability to study. Dedicated support and reasonable adjustments for students who are disabled or have a long-term health condition. Discover our wide range of health and wellbeing events you can attend throughout the year. Find out how to access health care, including important information on registering with a GP and vaccinations. Guidance on keeping yourself safe whether in person or online, in London or elsewhere, and who to contact in an emergency. Learn more about the support available for students who are victims of sexual harassment, violence or abuse, both within and outside of UCL. Find out how we support students who are affected by alcohol, substance use, unwanted or addictive behaviours. Find out about the support available both within and outside of UCL. Find out about Student S","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:18:05.290779+00:00","last_modified":"Fri, 24 Oct 2025 08:23:52 GMT"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/about-us","service_name":"About us","category":"Wellbeing","description":"Students Find out about the opening times for our Student Support and Wellbeing Services Desk. Learn more about the Student Support and Wellbeing Services Phone Line and the UCL 24/7 Student Support Line. Find out about the support available during the UCL closure period. Meet the team members in Student Support and Wellbeing Services, a growing department of friendly and empathetic wellbeing professionals. Find out about the available data sets for Student of Concern reports and Reasonable Academic Adjustments data. Find out how Student Support and Wellbeing Services offers support to students of all races, ethnicities, genders, religious backgrounds and sexual orientations. Student Support and Wellbeing Services is committed to providing high-quality customer service. Discover more about our strategy, and the work we are doing to implement this. Find out information and updates from the 'Beyond the SoRA' programme. Find out more about the complaints procedure in Student Support and W","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:16.330321+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/about-us/beyond-sora-programme","service_name":"Beyond the SoRA Programme","category":"Wellbeing","description":"Students Below you will find information and updates from the 'Beyond the SoRA' programme. 'Beyond the SoRA' has been commissioned to assess and re-develop the Reasonable Adjustments system here at UCL. While 'Summary of Reasonable Adjustments', 'SoRAs', have now been retired, the task of addressing Reasonable Academic Adjustments continues. This programme seeks to find new technical solutions, create new policies, and establish new processes to make Reasonable Academic Adjustments more inclusive and accessible for students; enabling them to fulfill their academic potential regardless of the challenges they face. The programme will be administered via fourteen interconnecting workstreams, each with specific driving questions, workstream leads (see below), and membership drawn from UCL's academic and professional services staff. A programme board has also been created and will provide a discursive space, general programme governance, and will output reports and recommendations for the i","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:24.120826+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/about-us/closure-periods-2025-support-and-services","service_name":"Closure periods 2025 - support and services","category":"Wellbeing","description":"Students Between Terms 1 and 2, UCL will be closed from  5:30pm on Tuesday 23rd December 2025 to 9:00am on Monday 5th January 2026. You still have access to plenty of support during this period. Please note that Student Support and Wellbeing Services will have a reduced level of service over the break: if you require urgent assistance during this time, please refer to the urgent out of hours support above. is a free, confidential wellbeing service available 24-hours a day, 7 days a week, 365 days a year. You can talk to an adviser by phone on: . and will be closed for during the Spring Break. During this time, t You can find the closest A&E to your location by using the and putting in your postcode. 07825 165464. on 24 hours a day, 7 days a week. If you are staying in UCL halls over the closure period, you will have access to the same support as usual from your team of . Someone from the team will be available throughout this time if you need assistance. In an emergency, contact the UC","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:30.006482+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/about-us/complaints-procedure","service_name":"Complaints procedure","category":"Wellbeing","description":"Students UCL is committed to providing a high-quality educational experience for all students, if you’re unhappy with the way we’ve dealt with something, please let us know so we can better support you. UCL encourages students where possible to initially try to submit an informal complaint through this form. We would like to reassure our students that all complaints will be handled in a professional and respectful manner. of the complaint being received; in the event that the reviewer is on leave the complaint will be passed to a deputy within our teams. We know that sometimes when you need support it might not occur during our opening hours, we have dedicated support 24/7 should you need to speak to someone urgently. We have same-day appointments available on weekdays that are bookable on the day, these are first come first serve and where we are concerned about your wellbeing, please be assured that we will take measures to provide support. . UCL has a tool for reporting instances of","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:22.764922+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/about-us/data-and-insights","service_name":"Data and insights","category":"Wellbeing","description":"Students Welcome to UCL Student Support and Wellbeing Service's Data and Insights Hub. These pages and supporting guides explain a little of the community we serve; they also underscore how our service is a data-driven and evidence-led function that responds to emerging student needs. On these pages, you will find key information relating to , , and . The number of enquiries supported through askUCL during Term One of 2024-25. Student registrations with our Counselling Team during Term One of 2024-25. Student of Concern reports submitted across the 2024-25 Academic Year. Each year, our Service compiles both an annual and a termly impact report that demonstrates some of the compassionate, caring, and preventative work we do. You can access the latest copies of these reports below. You can view a copy of these reports here: Student of Concern reports submitted by our external partners (NHS, Local Authority etc.) The total percentage of Student of Concern reports processed within 72 hours","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:27.586238+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/about-us/meet-student-support-and-wellbeing-services-team","service_name":"Meet the Student Support and Wellbeing Services team","category":"Wellbeing","description":"Students For general enquiries, please get in touch with us through askUCL, our student enquiries system. Find out about Student Support and Wellbeing Services' Leadership Team Find out about Student Support and Wellbeing Services' Strategy, Governance and Projects team Find out about Student Support and Wellbeing Services' Disability and Neurodiversity, Mental Health and Wellbeing, and Specialist Study Skills team Find out about Student Support and Wellbeing Services' Student Support and Enquiries team Find out about Student Support and Wellbeing Services' Counselling Services team Find out about Student Support and Wellbeing Services' Study Abroad team Find out about Student Support and Wellbeing Services' Specialist Advice and Casework Services team Find out about Student Support and Wellbeing Services' Events and Campaigns team Find out about Student Support and Wellbeing Services' Student Advisers Find out about Student Support and Wellbeing Services' Chaplaincy team Find out abou","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:29.037556+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/about-us/prevention-care-excellence","service_name":"Prevention. Care. Excellence.","category":"Wellbeing","description":"Students Student Support and Wellbeing Services Strategic Plan: Prevention. Care. Excellence. We will reimagine what ‘Support’ and ‘Wellbeing’ look and feel like for students in an increasingly changing world. We will continue to embed the importance of wellbeing and mental health in a university-wide mission, with clear and visible leadership, building on the University’s Mental Health Charter Mark. We will establish our supportive, preventative approaches as the means through which interventions are increasingly delivered and advance our influence to reduce harm and advance preventative and transformative support. Our strategy has been grouped together under five pillars. Within each of these pillars, we set out our ambitions and individual priorities which will help us deliver our plans. Studying at UCL is a transformative experience. We champion preventative-first approaches to the work we do with students and directly respond to the student voice. We believe that prevention is the","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:25.414364+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/about-us/support-your-faculty","service_name":"Support in your faculty","category":"Wellbeing","description":"Students This page lists the wellbeing support offered by your faculty. Some faculties offer additional support to students outside of Student Support and Wellbeing Services.  Below is a list of Faculties that currently provide this support. If you are a First Year Undergraduate student looking for support from , please visit our dedicated page on Student Advisers. Hello, I’m Teresa, the Student Adviser for Postgraduate Research students in the Bartlett Faculty of the Built environment. Email Teresa Dawkins at : Hello, I’m Henny, the Wellbeing Adviser for Undergraduate Second Year students and Postgraduate Taught students in the Faculty of Life Sciences. Email Henny Green at: Hello, I’m Gabriella, the Wellbeing Adviser for Undergraduate Second Year students and Postgraduate Taught students in the Faculty of Life Sciences. Email Gabriella Emmanuel at: Hello, I’m Rebeca, the Student Adviser for Online Postgraduate Taught students for Population Health Sciences. Email Rebeca Eaton at: Hel","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:19.063217+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/about-us/visit-us","service_name":"Visit us","category":"Wellbeing","description":"Students We are here to assist you with questions or concerns you may have about your Wellbeing, Student Record, Fees, Funding or any matters regarding your studies and life at UCL. we will be open between 10:00 - 18:00 on Monday, Tuesday, Wednesday & Friday. 10:00 - 16:00 on Thursday. we will be open between 9:00 - 17:00 on Monday, Tuesday, Wednesday & Friday. 9:00 - 16:00 on Thursday. We offer you a range of support. See the we offer and how we can help you. Please note that meetings with an adviser from Disability and Neurodiversity or Mental Health and Wellbeing You can via askUCL. Watch this , or read our to find out how to do so. Phone: Average queue time: 1 minute (this may increase to 3-4 minutes during Autumn enrolment periods). askUCL enquiries: We aim to provide you a first response within 5 working days (our response time may increase to 10 working days during Autumn enrolment periods). Service for third parties: First response within 10 working days. Please check our .","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:31.296139+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/additional-info/student-support-and-wellbeing-services-videos","service_name":"Student Support and Wellbeing Services videos","category":"Wellbeing","description":"Students Videos from  Student Support and Wellbeing Services to help you settle in to life at UCL and keep informed of the support available to you during your time with us.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:12.188891+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/additional-information","service_name":"Additional information","category":"Wellbeing","description":"Students Information, resources and training for staff on helping a student with emergencies, mental health, disabilities and more. Find out how you can help your child get the most out of university as a parent or guardian.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:08.509448+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/concerns-about-student/student-concern-form","service_name":"Student of Concern form","category":"Wellbeing","description":"Students If the student you are referring is at imminent danger to themselves or others, The Student Support and Wellbeing Services (SSWS) are not an emergency service and delaying a call to the emergency services could be detrimental to the student and those around them. Please complete the form to submit your Student of Concern report. Please quote your generated reference number in any correspondence. You can contact the team on Alternatively, you can fill in the interactive form below:","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:07.432386+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/disability-and-neurodiversity/convert-files-accessible-formats-sensus","service_name":"Convert files to accessible formats with Sensus Access","category":"Wellbeing","description":"Students Convert PDFs, JPEGs and other files into an e-book, text file, audio or braille.\nYou can combine more than one .JPG into a single file. Take for step by step guide to conversion, or Visit for guidelines, best practices, learning resources, instructional videos, presentations and academic papers. You can make an accessible copy if you own the copyright (eg, it's your own work), have permission from the copyright holder, if the , or if it's for someone with a print disability. If so you need to agree that:","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:07.691767+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/disability-and-neurodiversity/disabled-students-allowance-dsa","service_name":"Disabled Students' Allowance (DSA)","category":"Wellbeing","description":"Students . For students applying for DSA England*, after submitting your application form to Student Finance, (current student) or (applicants/in-coming students) telling us your:","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:06.389741+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/disability-and-neurodiversity/funding-support","service_name":"Funding for support","category":"Wellbeing","description":"Students Disabled postgraduate research students funded by one of the seven UK Research Councils can apply for Disabled Students' Allowance (DSA) to help with additional study-related requirements. To apply for Research Council DSA, , attaching your UKRI studentship letter. . Students' Union UCL runs the Student Participation Fund to support UCL students who are facing a significant financial barrier to participating in extra or co-curricular activity, such as purchasing or renting adaptive equipment for disabled students taking part in club, society or other similar activity. .","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:05.184474+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/disability-and-neurodiversity/general-disability-resources","service_name":"General disability resources","category":"Wellbeing","description":"Students On this page you will find a selection of extra information to help you during your time at UCL. The Invisible Disabilities Sunflower lanyard scheme is an initiative designed to act as a discreet sign that somebody has an invisible disability and requires additional assistance while out in public. You do not have to identify yourself or register any information to access a lanyard, and they are available to free of charge. Students' Union UCL offers supported fitness sessions for all disabled students. UCL has the Equality, Diversity and Inclusion Network for students and staff providing useful and more in-depth information across issues relating to disability, race, gender, religion and belief and sexual orientation amongst other equalities initiatives. Through this you'll be able to access: We have a whole host of free applications, programmes and tools to help users with visual and tracking impairments. These include screen-readers for Windows, other computer apps, browser","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:08.968955+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/disability-and-neurodiversity/guidance-non-medical-helpers-nmhs-and","service_name":"Guidance for Non-Medical Helpers (NMHs) and Needs Assessors","category":"Wellbeing","description":"Students This page contains information for Non-Medical Helper (NMH) providers and Needs Assessors regarding support available to disabled students at UCL. For queries relating to: Please contact us via . To send quotes and invoices, and to make any queries regarding an invoice, please contact us via - this is a staff and supplier inbox only. Alternatively, you may look at booking a space in the British Library (requires membership) or Friends House. but you must clearly indicate the reason and the amount of notice given on the invoice and/or timesheet, eg. student sickness (less than 24 hours’ notice). . We also offer specialist mentoring support, but it is not under DSA funding. Please feel free to contact us through for more details.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:03.979168+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/disability-and-neurodiversity/specific-learning-differences-splds","service_name":"Specific Learning Differences (SpLDs)","category":"Wellbeing","description":"Students If this is your last year of study, the deadline to request and return your screening for academic year 2024-2025 is as follows: Wednesday 12th February 2025. Monday 9th June 2025. ecific earning ifferences (SpLDs) affect the way information is learned and processed. SpLDs are: Outside of academia, Specific Learning Differences are usually referred to as 'neurodivergent' conditions. The best way to let us know is to register with us via the Applicant Support Questionnaire (ASQ) on Portico. Here you'll be able to upload supporting documents and detail the support you need. You can also provide consent for us to handle your data to implement the support. We will get in touch once we review your ASQ. You can contact us via to ask for a screening or inform us about your SpLD diagnosis. Please send us a copy of the supporting document or waiting list email/letter via askUCL so we can discuss your options. If you have DSA and UCL is your provider, you can book with us directly for S","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:02.531476+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/disability-and-neurodiversity/support-we-offer","service_name":"The support we offer","category":"Wellbeing","description":"Students The Disability and Neurodiversity team provide information, support and advice surrounding: We are made up of a team of specialist advisers and coordinators, within the wider Student Support and Wellbeing Services department, including support staff. We provide a safe, and non-judgemental space, in which you can discuss your wellbeing, mental health, or disability queries and concerns, particularly those affecting your ability to study. Our team will work with you to explore solutions, improve accessibility and ensure you have equitable access by removing barriers and promoting inclusivity. We are here to enable and enhance access to your studies, teaching and learning, and living experience at UCL. When you meet one of our advisers, you can discuss these varying forms of reasonable adjustments. Our advisers come from a wide variety of backgrounds and have specialities in the following areas: • Mental health conditions/disabilities; • Physical disabilities; • Neurological cond","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:01.440892+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/disability-and-neurodiversity/your-reasonable-academic-adjustments","service_name":"Your Reasonable Academic Adjustments","category":"Wellbeing","description":"Students If you are a student with a disability or have a health condition that you feel might impact on your ability to perform in assessments, you can apply for Reasonable Academic Adjustments. We have introduced a new name - Reasonable Academic Adjustments - and process for submitting Reasonable Academic Adjustments from September 2025. If you were studying with us before September 2025, you may have used the term Summary of Reasonable Adjustments or 'SoRA' for short: Reasonable Academic Adjustments replaces this. From now, new applications for Reasonable Academic Adjustments will be made through Portico. Staff will review and process applications on Portico and you will be able to view your adjustments on Portico. You can find out about the new process below. If you had a Summary of Reasonable Adjustments (SoRA) in place before September 2025, your agreed adjustments will be transferred to our new system on Portico. This will take place in October 2025. We will send you an email wh","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:10.485748+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/emergency-contacts","service_name":"Emergency contacts","category":"Wellbeing","description":"Students On this page you can find useful contacts for emergencies, both on UCL campus and off campus. You can also find additional resources for students to ensure you stay safe. On this page: If you witness or experience an emergency, such as a crime, a fire, a serious accident or a medical crisis, you should phone the numbers below. You can also go to the Accident and Emergency ( ) department of your local hospital. Use the to find the closest hospital to you. This number can be used to report crimes that do not need an emergency response, such as a bike theft. This number can be used if you experience a medical problem that you do not feel is an emergency, or if you are unsure where to access the correct health care support. UCL aims to provide and maintain a safe, secure and healthy environment for its students. Please call this number if you witness or experience a crime or security concern on campus. Please call this number to speak to the Sophie Bimson, the Crime Prevention and","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:06.649456+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/events-and-activities","service_name":"Events and activities","category":"Wellbeing","description":"Students We curate our campaigns to support the three core aspects of your UCL experience: bonding, for life and at university. Each activity aims to develop one, two, or all three of these aspects. Working with the charity Pets as Therapy (PAT), our monthly sessions reduce loneliness and bring joy to UCL all year round. Learn more about the and find out when they're next on campus. . Settle in, make friends and navigate your journey with creative activities, from pumpkin carving to sketching, academic skills workshops, and day trips. . Meet new people and beat the winter blues with our sports and crafting sessions, karaoke, comedy nights, and much more. . Build skills, gain confidence and prepare to succeed with group study sessions and revision workshops. Take some time out with crafting and animal therapy sessions. Facilitated by specialist caseworkers who are within UCL's Student Support and Wellbeing Services, this six-week wellbeing workshop is for students who have experienced a","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:57.378164+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/events-and-activities/beat-january-blues","service_name":"Beat the January Blues","category":"Wellbeing","description":"Students Each activity aims to develop one, two or all three of these aspects. Please note that for the 2024-25 Academic Year and we are currently in the planning stages for the next round of this campaign which will be in . Explore our for details of our other campaigns and additional events throughout the academic year. To receive information and updates for when bookings open for future events and campaigns, register your interest using the button below. We hope to see you at our activities!","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:15.243345+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/events-and-activities/exam-season-toolkit","service_name":"Exam Season Toolkit","category":"Wellbeing","description":"Students Each activity aims to develop one, two or all three of these aspects. Learn our top tips and techniques for looking after yourself before, during and after exams with Your Assessment Wellbeing Guide. This guide covers methods for spotting signs of stress, wellness worksheets, a weekly revision timetable template and advice on supporting a friend. The webpage also includes our video on how to manage panic symptoms during exams. Please note that for the 2024-25 Academic Year and we are currently in the planning stages for the next round of this campaign which will be in . Explore our for details of our other campaigns and additional events throughout the academic year. To receive information and updates for when bookings open for future events and campaigns, register your interest using the button below.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:13.506684+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/events-and-activities/here-support-you-guide","service_name":"Here to Support You Guide","category":"Wellbeing","description":"Students Guiding you through UCL Student Support and Wellbeing Services. The Here to Support You Guide provides comprehensive information on all support services available to you at UCL. Produced by Student Support and Wellbeing Services and designed for UCL students of all levels, the guide is categorised by the following sections: You may also find printed versions of the Here to Support You Guide around our campuses, which we welcome all students to read at their leisure. The guide is provided as a PDF e-booklet and is available to download. You can print out the booklet using the . You can also read our digitally accessible Microsoft Word version of the Here to Support You Guide:","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:00.260539+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/events-and-activities/meet-therapy-dogs","service_name":"Meet the Therapy Dogs","category":"Wellbeing","description":"Students Want to know a more about our Therapy Dogs? See below for when they are on campus, and enjoy their mini bios to learn their names, breed and favourite activities! We're lucky enough to work with many wonderful volunteers at the (PAT) charity to bring Therapy Dogs onto campus to boost your mood, reduce homesickness and encourage you to take time out from your studies. Our sessions are usually held in the (outside the Student Centre) and the on the UCL Bloomsbury Campus. Some sessions are held at  UCL East Campus in the Level 4 Project Space. If the session is at East, it will be indicated below. There is no need to book, simply turn up and pet a pooch! Read on to meet the Therapy Dogs and learn more about them! : Tinkerbell : Chihuahua : Female : Pat : I love to run like a Whippet, be with people and enjoy the company of other dogs. : Bella : Cockapoo : Female : Jessica : I love playing ball in the park and eating chicken. : Mocha : Cavachon : Male : Fiona : I love cuddles and","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:12.681314+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/events-and-activities/uclsupport-blog","service_name":"UCLsupport blog","category":"Wellbeing","description":"Students Please enable JavaScript to use this page or","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:16.403921+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/events-and-activities/your-guide-thrive","service_name":"Your Guide to Thrive","category":"Wellbeing","description":"Students Each activity aims to develop one, two or all three of these aspects. Join us in for a range of fun, free events to help you settle into life at UCL, make new friends, and learn a new skill! Explore our for details of our other campaigns and additional events throughout the academic year. To receive information and updates for when bookings open for future events and campaigns, register your interest using the button below. We hope to see you at our activities! Join Dr Jessica Harland from Gower Street Practice to find out how to access medical care in the UK. Find out more about the range of fun and free events available for Affiliate Students : Learn how to manage symptoms of stress and look after your wellbeing at university with experts from iCope. Join our free Pumpkin Carving event. Create your own jack-o'-lantern and make new friends! Join UCL's International Student Support team, part of Student Support and Wellbeing Services, for a scavenger hunt in the British Museum","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:12.447947+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/general-support","service_name":"General support","category":"Wellbeing","description":"Students If a sudden and unexpected event disrupts your assessments, you can apply for an 'Extenuating Circumstances' (EC) claim. See our step-by-step guide if you are considering interrupting or withdrawing from your studies. Find out how to apply for Delayed Assessment Permit on Portico.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:18.443495+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/general-support/dbs-document-checking-service","service_name":"DBS Document Checking Service","category":"Wellbeing","description":"Students Most Students will now be able to use the Digital ID verification process. If you are an international student and can generate a sharecode to prove your immigration status, you should select when choosing a document that proves your right to work and study. If you have any questions about how to complete your form, please visit the : call us on +44 (0) 20 3108 8836. Prior to submitting your information you will be asked to read and agree to a consent statement in line with the requirements of the DBS, the DBS Code of Practice and data protection legislation. If you are no longer able to provide the documents you have selected on your application, or if the dates on your documents become out of date (e.g., they are no longer within the specified three month time period), please on and we can cancel your application and re-start the process. If you have questions about how to apply for a DBS Disclosure or what ID documents to submit for your DBS Check, please look at the guidan","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:22.538723+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/general-support/third-party-confirmation-enrolment","service_name":"Third Party Confirmation of Enrolment","category":"Wellbeing","description":"Students Below is a list of common forms and where to get them signed.\n\nYou may be able to digitally submit the relevant forms via askUCL. The Student Support and Wellbeing Services may be able to complete some official forms for you if the information required is held on your central student record. You can call the Student Support and Wellbeing Services to ask us to sign them, or attach the digital form to . Arrival forms can only be signed off once you are enrolled and after the attendance start date. Departure/Attendance forms can only be signed off once you have completed your course and the end date of registration has passed. If you choose to leave UCL before the official end date of your UCL course and need your Erasmus+ Arrival/Departure Certificate signing, you should first get written permission from your home institution and then your UCL academic department. Please visit to find out more about this form. about this. Please visit s to find out more about this form. Please v","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:21.327062+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/general-support/third-party-verification-requests","service_name":"Third Party Verification Requests","category":"Wellbeing","description":"Students Student Support and Wellbeing Services can provide potential employers, agencies and other third parties with verification of student status and qualifications for current and former students of UCL. UCL offers the following services in regard to the confirmation of results and awards for third party verification purposes: Please note we are unable to complete individual reference request forms, or provide character/academic references. For UCL employee references, please get in touch with . If you are UCL alumni, please use for further assistance. If you do not have access to askUCL, please call us on +44 (0)20 3108 8836 during or email us at . After completing their degree and receiving their results notification with their final results, students will receive an Award Certificate and official transcript. Students awarded from November 2023 will receive their Award Certificate in both hard copy and digital format: Digital Award Certificates for these students will be availab","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:23.728187+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/harm-reduction-ucl","service_name":"Harm Reduction at UCL","category":"Wellbeing","description":"Students The Harm Reduction policy is provided as a PDF and is available to download. You can print out the booklet using the . You can also read our accessible text version of the UCL Harm Reduction Policy. Our Harm Reduction Policy offers resources, education, and support to help students make informed choices and raise awareness of the risks associated with substance use and alcohol consumption, and with addictive or unwanted behaviours such as gaming, gambling and pornography use. The policy includes: are extremely proud to be in the implementation stage of Harm Reduction at UCL, replacing the previous approach of zero-tolerance. In September 2022, a student article was published with a critical stance on UCL's approach to drugs. Responding to the student voice and part of their campaign work, the , part of Student Support and Wellbeing Services, sought to gain further insight into the student perspective and experience, by attending the Students’ Union Welfare and Community Zone d","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:06:54.032691+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/harm-reduction-ucl/alcohol-free-social-spaces-campus","service_name":"Alcohol-free social spaces on campus","category":"Wellbeing","description":"Students This page covers a list of social spaces across the Bloomsbury and UCL East campus which are alcohol-free. It can feel like a lot of university events focus heavily on alcohol centred socials, but there are lots of events and spaces at university which are alcohol-free. In fact, found that 26% of students at university do not currently drink alcohol. Whether you don't drink for cultural or religious reasons, have experienced problems with alcohol, are not a fan of drinking, or are joining UCL before your 18th birthday, there's a wide range of alcohol-free social spaces on the UCL campus. Although alcohol is not usually sold or consumed in the areas listed below, we cannot guarantee that the spaces will never have alcohol present. There could be certain very infrequent instances, such as ad-hoc events, where alcohol is present. The cafe is located on the third floor of the Student Centre. Accessible lifts are available. The following spaces at Marshgate are alcohol free spaces:","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:01.545288+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/harm-reduction-ucl/campaigns-harm-reduction-2025-26","service_name":"Campaigns for Harm Reduction in 2025-26","category":"Wellbeing","description":"Students Our Events and Campaigns plans will provide students with practical tools, advice and guidance on staying safe, making informed choices and reducing risk. Since joining SOS-UK's , UCL's Harm Reduction Steering Group has formed different sub-groups to focus on delivering specific aspects of implementation. There are two sub-groups dedicated to Harm Reduction events and campaigns: Subgroup 7 - Initiatives and Events and Subgroup 8 - Welcome and Induction. These coasters will be in the to raise awareness of Harm Reduction and support available to students.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:00.375540+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/harm-reduction-ucl/drug-and-alcohol-impact-survey-report","service_name":"The Drug and Alcohol Impact Survey Report","category":"Wellbeing","description":"Students The report is provided as a PDF and is available to download. You can print out the booklet using the . You can also read our accessible text version of the UCL Drug and Alcohol Impact Survey Report - March 2025","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:06:58.936918+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/harm-reduction-ucl/ucl-harm-reduction-strategy-and-action-plan","service_name":"UCL Harm Reduction Strategy and Action Plan","category":"Wellbeing","description":"Students UCL has approved a harm reduction approach to drugs and alcohol which has replaced the previous zero-tolerance approach. UCL and the UCL Students’ Union are committed to the safety and wellbeing of our students. We do not condone the use of illegal drugs or the misuse of prescription drugs, but we do understand that some students may choose to use or try them during their time at university. We also understand that a zero-tolerance stance is harmful and damaging as it prevents students reaching out for help or resources as they may fear being punished. Should our students choose to engage in any risky behaviours, awareness of the dangers is paramount to making informed choices. Education and support offer students the opportunity to greatly reduce the risk of short and long-term harm and this approach encourages safe and confidential disclosure of concerns around substance use. Therefore, we believe a harm reduction stance, as part of a broader strategy around the wellbeing of","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:06:57.844427+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/harm-reduction-ucl/ucl-programmes-fitness-practise-procedures","service_name":"UCL Programmes with Fitness to Practise Procedures","category":"Wellbeing","description":"Students Find out about UCL's Fitness to Practise Procedures for students on professional programmes. UCL students on professional programmes are subject to Fitness to Practise Procedures. The exact procedures that apply depend on the programme of study and the associated regulatory body. Although support is available from for all students, and student wellbeing will remain the priority in all cases, students on professional programmes that are subject to Fitness to Practise Procedures will be referred to their faculty in instances where a behaviour or incident may contradict or break what is outlined by their faculty, department or programme regulatory body. Students on professional training programmes are expected to conduct themselves and to behave in a professional manner at all times, both at UCL, in the workplace and in their conduct outside of work, in line with the professional codes of practice that apply to their discipline. Please contact Sarah Bennett for more information.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:06:56.422417+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/identity","service_name":"Identity","category":"Wellbeing","description":"Students The UCL Equality, Diversity and Inclusion (EDI) team offer a range of intercultural resources, networks and equality initiatives. Whatever your religion or belief, the Chaplaincy and Interfaith Advice team provide faith-based support to everyone at UCL. You can receive internal UCL support and find external organisations for LGBTQ+ students.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:26.132879+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/if-you-are-concerned-about-student","service_name":"If you are concerned about a student","category":"Wellbeing","description":"Students Find out when and how to raise a concern about a student's wellbeing or safety with Student Support and Wellbeing Services. On this page: This information is for UCL students and staff members, as well as, third parties who may be concerned about the wellbeing or safety of a UCL student. If you have concerns that a student is in immediate danger of hurting themselves or others, phone or the If you have called , and you are on campus, you must let know that emergency services are coming so that they will be able to wait for them and accompany them to your location.  Call on , ( or use the (press the blue button for Security). You should wait with the student for the emergency services to arrive. If the student requires medical attention, find out if there is a in your department that you can contact to assist. Should you deem it safe (i.e. if the student has the mental capacity to keep themselves safe) for them to walk or get a taxi to A&E, make sure they have a friend to accom","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:05.377715+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/mental-health-and-wellbeing/counselling-services","service_name":"Counselling services","category":"Wellbeing","description":"Students If you are not yet registered with a GP doctor, please see below. Please note: (not the old one mentioned in the video below!) Counselling Services offer up to 6 free counselling sessions per year, , for all students who are actively engaged in study at UCL. In SST we work in a focused way to help you deal with your most pressing concern in one session. Offering SST means we can provide support and help with the transition from university, ensuring that you receive support before your time at UCL ends (Please be aware that we are unable to provide you with an Extenuating Circumstances letter after your single session appointment. Should you require this, please do contact your GP). Register with the service to access support Find out more about our process, including initial consultations and ongoing sessions. Look here for answers to our Frequently Asked Questions. Borrow one of our self-help books or find out which organisations offer external support. Find out how to access","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:28.903358+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/mental-health-and-wellbeing/how-we-can-support-your-mental-health-0","service_name":"How we can support your mental health and wellbeing","category":"Wellbeing","description":"Students There is always help available to you throughout your time with us at UCL. Our professional staff can provide you with advice and support on a wide range of mental health and wellbeing subjects, to help you get the most out of student life. The support we provide is free and available to any student enrolled at UCL. . We strongly recommend that students so we can get in touch and fully review what kind of support and reasonable adjustments you may need. With valid evidence, you can apply for Reasonable Academic Adjustments on the basis of your mental health conditions. We speak to all students about how a long-term mental health condition affects access to education to ensure appropriate support is applied. To help our students manage the impact of any long-term mental health difficulties on their studies, we provide access to a specialist mental health mentoring scheme. This involves regular meetings with a mentor who will work with you to help you identify and overcome barri","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:27.383329+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/mental-health-and-wellbeing/looking-after-your-mental-health","service_name":"Looking after your mental health","category":"Wellbeing","description":"Students UCL (SSWS) can direct you to appropriate support both within and outside of UCL. The support we provide is free and available to any student enrolled at UCL With valid evidence, you can apply for Reasonable Academic Adjustments on the basis of your mental health conditions. We speak to all students about how a long-term mental health condition affects access to education to ensure appropriate support is applied. Student Support and Wellbeing Services do not offer emergency support. If you're in immediate danger of hurting yourself or others: If you're feeling distressed and need urgent support: Our Here to Support You Guide provides comprehensive information on all support services available to you at UCL. Produced by Student Support and Wellbeing Services and designed for UCL students of all levels, the guide is categorised by the following sections: . The guide is provided as a PDF e-booklet and is available to download. You can print out the booklet using the . If you are c","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:24.798125+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/mental-health-and-wellbeing/looking-after-your-wellbeing","service_name":"Looking after your wellbeing","category":"Wellbeing","description":"Students UCL (SSWS) can direct you to appropriate support both within and outside of UCL. The support we provide is free and available to any student enrolled at UCL There are a variety of organisations that offer support for looking after your wellbeing. The Hive delivers a free drop-in health and wellbeing service to support young people aged 16-24 who are connected to Camden. The mental health charity host a regular Together Café for Newham residents aged 18+ facing mental health challenges. The café is open from Monday to Thursday and on Fridays, weekends and bank holidays. The Together Café warmly welcomes all, with no referral process required. The team offers short-term support to equip attendees with recovery strategies, provided in partnership with ELFT. The café offers: group support, one-to-one support, and art therapy. You can call the Newham Together Café on 07511075701 and email the team at . . Learn the definitions of stress and the range of external support and resource","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:26.180390+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/mental-health-and-wellbeing/ucl-student-support-and-wellbeing","service_name":"UCL Student Support and Wellbeing Services phone lines","category":"Wellbeing","description":"Students Learn more about the Student Support and Wellbeing Services Phone Line and the UCL 24/7 Student Support Line. Our telephone service is available on In-the-moment support is available via the UCL 24/7 Student Support Line, in 35+ languages. The advisers reflect the diverse range of backgrounds needed from our students. You can curate your own experience by selecting to speak to a male/female adviser, a BAME adviser or an adviser with additional training in LGBTQ+ related issues. In this section: UCL 24/7 Student Support Line is a free, confidential wellbeing support service available 24-hours a day, 7 days a week, 365 days a year. You can talk to an adviser by phone on: You will have three options - if you are looking to speak to someone in relation to: UCL 24/7 Student Support Line use a brief solution-focused therapy (BSFT) model. This is a short-term counselling approach which allows flexibility. It is evidence-based and has been shown to be effective and successful. BSFT is","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:29.891666+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/mental-health-and-wellbeing/urgent-and-out-hours-mental-health","service_name":"Urgent and out of hours mental health support","category":"Wellbeing","description":"Students A list of urgent help and/or out of hours support. On this page: If you're not immediately worried about keeping yourself safe, but are feeling distressed and would like urgent support, you should call the free NHS out-of-hours medical line on or contact them and they will help you access the right services. You may also contact (doctor) surgery to request an emergency appointment. If you're in immediate danger of hurting yourself or others: If you are experiencing difficult thoughts and feelings, the UCL Counselling Service Stay Safe Card offers information on how to cope with your emotions. There are a number of external services that may be able to help if you are feeling distressed and/or are concerned about managing suicidal thoughts. This service offers short-term support to residents of Camden presenting with a mental health crisis. The free Samaritans service is for people who are feeling suicidal or just need someone to talk to. Maytree is a charity that provides supp","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:19.854932+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/personal-safety","service_name":"Personal safety","category":"Wellbeing","description":"Students UCL’s Crime Prevention and Personal Safety Team are here to share important safety and security messages with students, from online safety and keeping your property secure to addressing personal safety issues. In an , call . You can also contact UCL's Security team direct from your phone with the . For support, call . You will speak to the Crime Prevention and Personal Safety Office. You can visit the team on the ground floor of on Malet Place, opposite the Petrie Museum. Emergency contacts and information on how to report a crime. Download the UCL SafeZone app to make it easier for you to contact UCL Security in an emergency. The team provides support, advice and information to keep you safe in London. Report harassment, discrimination or sexual misconduct and find support information. Information on how to avoid scams and frauds, including how to stay safe online. Information on staying safe in London and around campus. Spiking is a serious criminal offence which can sometim","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:46.371022+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/personal-safety/fraud-and-scams","service_name":"Fraud and scams","category":"Wellbeing","description":"Students Here are our tips on how to stay safe online and avoid scams online or over the phone. When using phones, tablets or laptops for online activity, it is important to keep your personal data safe. On this page: There are a number of measures you can take to ensure you keep yourself and your personal details protected online. Be careful of email scams. In the past, there have been emails sent to students and staff from those posing to be friends asking for money. These people supposedly needed help, but were scammers. Read on to learn how to identify scams and fraud. Check these carefully. An email may look like it has come from a friend, but there is a slight variation - an added letter or number, for example. Do not transfer money to anyone unless you are entirely sure the request is genuine, and you know the person. Criminals may target you online or over the phone pretending to be from an official organisation such as the UK Home Office or an education agent. They demand mone","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:55.457711+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/personal-safety/safety-london","service_name":"Safety in London","category":"Wellbeing","description":"Students Whether you are in London or elsewhere in the UK, here are some tips on how to keep yourself as safe as possible. On this page: For information on staying safe at UCL, visit the and read the There are a few security issues to stay aware of while you are on campus or in the area near UCL. Remember to always carry your ID with you at all times and do not give it to anyone else. Be aware of tailgating. If you feel that a person is following you in order to access an area where you believe they should not be, challenge them - as long as you feel comfortable and safe to do so. Alternatively, you can contact UCL Security via the . Phone snatching is often done by individuals on mopeds and bikes. To avoid being a victim of phone theft, adhere to the police advice.  Always be aware of your surroundings and avoid using your mobile phone wherever possible on the street.  Be vigilant, and look out for bikes and mopeds, especially if they are on the pavement. Read more about on the Metrop","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:56.359001+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/personal-safety/support-spiking","service_name":"Support for spiking","category":"Wellbeing","description":"Students Spiking is the act of putting alcohol or drugs into another person's drink, or into their body through another method such as injection via a needle or via a vape without their knowledge and consent. Figures show that 1 in 10 students have experienced spiking nationally. and carries a sentence of up to ten years in prison. If a robbery, sexual assault, or other crime took place, the sentence may be even longer. When someone has been spiked, it is always the person who spiked the drink who is responsible. The survivor is never to blame. In 2025, legislation is due to be introduced which will make spiking a separate and specific criminal offence of its own. The government’s proposed new legislation will aim to increase reporting of spiking and pose a stronger deterrent to violence. Being spiked can be a scary experience and it's important to be able to recognise the signs that you have been spiked or how to help someone you suspect has been spiked. Any drug can be used to spike","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:54.679082+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/personal-safety/ucls-crime-prevention-and-personal-safety-team","service_name":"UCL's Crime Prevention and Personal Safety Team","category":"Wellbeing","description":"Students UCL's Crime Prevention and Personal Safety Team has you covered and is on hand to give advice and information to keep you safe in London. UCL's Crime Prevention and Personal Safety Team are keen to share important safety and security messages with students, from online safety and keeping your property secure to addressing personal safety issues. Some of the most common crime related issues reported by students are: Students are encouraged to raise any concerns about their safety and security. No issue is too small if it is worrying you. Any concerns will be addressed in a non-judgmental, confidential and supportive way. After listening to you, the team will be able to tell you whether an offence has been committed (if appropriate) and what options are available to you, whilst giving advice to keep you safe. With your consent, they can signpost you to specialist support agencies for additional help. The Crime Prevention and Personal Safety team can deliver support via email, te","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:48.460672+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/physical-health-support","service_name":"Physical health support","category":"Wellbeing","description":"Students Student Support and Wellbeing Services does not offer emergency support. If you or someone else needs urgent medical assistance: If you would like to speak to a doctor about your symptoms or a pre-existing health condition: Your doctor (GP, or General Practitioner) is your first point of contact for any physical and mental health concerns. From emergency contacts and A&E, to sexual health, dental and eye care, you can access many NHS services. Students are more at risk of certain illnesses, so it is crucial that you receive the relevant vaccinations. Find the health and wellbeing services located near the UCL Bloomsbury Campus. Find the health and wellbeing services located near the UCL East Campus. Learn how you can access free menstrual products on campus.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:47.462054+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/physical-health-support/free-menstrual-products","service_name":"Free menstrual products","category":"Wellbeing","description":"Students Learn how you can access free menstrual products on campus. At UCL Student Support and Wellbeing Services, we recognise that a rise in period poverty means it is becoming more difficult for students to access menstrual products. That is why we offer menstrual products (pads, tampons etc.) at no cost for UCL students who need them. You can pick up the products at both of our Student Centres: Please speak to a member of staff who can provide you with the products you need. Additionally, you can access menstrual products through the Students' Union UCL , making period products accessible across campus.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:49.539775+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/physical-health-support/guide-health-care-services","service_name":"Guide to health care services","category":"Wellbeing","description":"Students The NHS offers a wide variety of health care services. This page clarifies where you can go to receive support. On this page: To access NHS services, you will need . Please ensure that you get a UK phone number when you arrive. Do not use a friend or flatmate’s mobile number, otherwise you will not be able to receive advice directly from your doctor. (A&E) deals with genuine life-threatening emergencies. A&E is known as the Emergency Room in other countries, like the USA. In the event of an emergency, go immediately to your local A&E department or for an ambulance. If you are ever in doubt about what to do in a serious situation, call 999. The NHS 111 service is a free helpline available to all. Call on your phone or mobile to speak to a healthcare adviser. The adviser will take you through a series of questions to direct you to the appropriate services relevant to your condition, such as A&E, a GP appointment, a walk-in centre or self-care. They may send for an ambulance if y","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:50.970910+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/physical-health-support/registering-doctor-gp","service_name":"Registering with a doctor (GP)","category":"Wellbeing","description":"Students It is very important to register with a GP (general practitioner) whilst you are at UCL so that you can access medical care if you need it. Doctors, also known as general practitioners (GPs), are based in surgeries or practices. They will be your first point of contact for most physical and mental health concerns. If you are a UK student on campus and are already registered with a GP in another part of the country, we recommend that you swap your registration to a GP near you in London. This will make it easier to access health care. If you go home during holidays, you should still be able to make an appointment at your local GP surgery, where you will be seen as a temporary patient. If you are an international student, registering with a GP should be one of the first things you do after arriving in the UK. The NHS provide a helpful search tool which finds the GP surgeries nearest to you. Simply use your postcode to see the closest options. Usually, choosing a GP surgery close","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:53.313003+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/physical-health-support/vaccinations","service_name":"Vaccinations","category":"Wellbeing","description":"Students Students are more at risk of certain illnesses than the general population. It is very important to have the appropriate vaccinations and remain vigilant for symptoms. On this page: Students can be more vulnerable than the general population to certain serious illnesses due to their age, living close to other students in halls of residence and mixing with lots of new people. By getting vaccinated, you can reduce your risk. You must remain vigilant of the symptoms of serious illness in yourself and others. You do not need to be to get vaccinated, but doing so can help to avoid any potential delays. Septicemia If you need the meningitis ACWY vaccine, you should ideally have it several weeks before you arrive at university, as it can take some time for your immunity to build up. If you're a UK student, your home GP (General Practitioner) should be able to arrange for you to have the vaccine. If you're an international student, ask your doctor for the vaccine - depending on what's","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:51.942871+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/sexual-harassment-misconduct-and-violence","service_name":"Sexual harassment, misconduct and violence","category":"Wellbeing","description":"Students UCL is committed to the safety and wellbeing of all student survivors. We are here to support you in whichever way you need. The legal definition of rape in England and Wales is when someone intentionally penetrates another person's vagina, anus or mouth with their penis, without that person's consent. Consent means agreeing by choice, freely and with understanding, and it can be withdrawn at any time. The law applies to people of any gender or age and includes situations like marital rape and acquaintance rape, with the crucial element being the absence of the complainant's freedom to choose and give consent. S Our Specialist Advice & Casework Team are specialists in supporting survivors of sexual violence and can offer advice and non-judgemental support around disclosing experiences, navigating systems, liaising with internal and external services and explaining the criminal justice system. To access confidential support from the Student Support and Wellbeing Services, you c","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:34.037670+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/specialist-support","service_name":"Specialist support","category":"Wellbeing","description":"Students Find out about the War, Conflict and Disaster (WCD) Service and how they can support you to cope, connect, and continue your studies through global challenges. Find out about the support available for students who are homeless or at risk of homelessness. Find out about the or LGBTQ+ students, mature students, students with children, BAME students, care experienced students and more. Find out about advice and support available to students affected by harassment, sexual misconduct, and gender-based violence","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:09.995553+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/specialist-support/specific-student-groups","service_name":"Specific student groups","category":"Wellbeing","description":"Students We are committed to providing equal opportunities for all students, including our People of Colour (POC) community. We're committed to supporting young people who have left a care environment and a range of additional support is available. Dedicated support and reasonable adjustments for students who are disabled or have a long-term health condition. If you're studying away from campus, you can still access a wide range of support services. Studying at university can present extra challenges for estranged students, but additional support is available. Information for students who identify as lesbian, gay, bi, trans, queer or another minority sexual orientation. UCL is a secular institution but is committed to providing an inclusive environment where students of all religions, and none, can thrive. If you are 21+ years old on your first day of study at UCL, you are a mature student and may have additional support. Comprehensive support is available for students who become pregn","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:16.004999+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/specialist-support/student-homelessness","service_name":"Student Homelessness","category":"Wellbeing","description":"Students The Specialist Advice and Casework Services team (SACS) offers specialist advice and support to UCL Students who are homeless or at imminent risk of becoming homeless. To access support just complete the form via the blue button below.  Y provides support to UCL students who are in unexpected financial need. We can refer you to a We will work with you to identify the central causes of your homelessness and provide relevant advice and support to alleviate the situation. We can refer you to our services to speak with an adviser from the , or our who offer up to six sessions of free therapy. You can contact the UCL Students' Union, who offer support for students who are searching for emergency accommodation. The SU can signpost you to relevant sources of support, and can refer you into an emergency accommodation process at the University if you are eligible. is a national homelessness charity who directly with people experiencing or at risk of homelessness in 9 areas across Engla","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:13.531217+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/specialist-support/war-conflict-and-disaster-service","service_name":"The War, Conflict and Disaster Service","category":"Wellbeing","description":"Students In 2022, this commitment took shape when UCL established the War, Conflict and Disaster Service in response to the invasion of Ukraine. This initiative marked an important step in addressing the longstanding needs of students affected by global emergencies. While demand for such support had existed for many years, this moment became a catalyst for meaningful and lasting action. Today, the War, Conflict and Disaster Service has grown into a comprehensive and inclusive programme, adapting to the complex and evolving needs of students affected by war, conflict, and disaster across the world. The service is made possible through close collaboration between , local NHS Talking Therapies providers, and the within the . To provide timely psychological support for students experiencing distress related to a recent or ongoing war, conflict, or disaster via ‘Cope & Connect’, based on the principles of To identify symptoms of trauma-related mental health difficulties, such as post-trauma","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:12.265203+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/suicide-prevention-and-support","service_name":"Suicide prevention and support","category":"Wellbeing","description":"Students Student Support and Wellbeing Services do not offer emergency support. If someone is at immediate risk of harming themselves (for example, if they've made a plan and are worried that they may act on it soon), then this is a crisis and the person should: If they are feeling distressed and need urgent support: If you are worried about the wellbeing of a student who is experiencing suicidal thoughts, you should contact Student Support and Wellbeing Services by completing a Student of Concern Form.  We will reach out to the student and offer support.  Please note that this form is monitored during office hours only. UCL (SSWS) can direct you to appropriate support both within and outside of UCL. The support we provide is free and available to any student enrolled at UCL. Our advisers have specific training in how to have conversations around suicide. If you're living in a UCL hall of residence, you have an additional network of support in the form of the , who live on site. They a","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:17.829592+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/suicide-prevention-and-support/what-do-if-student-has-shared-suicidal","service_name":"What to do if a student has shared suicidal thoughts (information for friends and family)","category":"Wellbeing","description":"Students This page contains information on what you can do to support a UCL student experiencing suicidal thoughts if you are a family member or a friend from inside or outside UCL. If you are worried about the wellbeing of a student who is experiencing suicidal thoughts, you should contact Student Support and Wellbeing Services by completing a Student of Concern Form.  We will reach out to the student and offer support.  Please note that this form is monitored during office hours only. It can be very distressing to learn that someone you are close to may be feeling suicidal. It is important to remember that this is common and one in four young people experience thoughts of suicide. These thoughts can be triggered by a number of different experiences, such as moving to a new place, new friends, and worries about study and/or employment. It is important to be there for them and to encourage them to access professional support as soon as possible. Help them stay connected and involved wi","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:21.411652+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/suicide-prevention-and-support/what-do-if-youre-having-suicidal","service_name":"What to do if you're having suicidal thoughts","category":"Wellbeing","description":"Students If you're having suicidal thoughts, there's a wide range of support available. This page will help you look after yourself and find an appropriate person to talk to. If you are feeling suicidal, the most important thing is to talk to someone. Many adults will experience suicidal thoughts at some point in their lives. The feelings that drive suicide are often temporary and situation-specific, for instance, a stressful event associated with feelings of loss can trigger suicidal thoughts. If you are going through a difficult period, you may feel isolated and disconnected from your personal support networks. You may also worry about the reaction and impact on those close to you if you share thoughts of suicide. It may feel awkward to start a conversation, and there isn’t a right or wrong way to talk about suicidal feelings. Starting the conversation is what’s important. You may want to talk to a trusted family member, a friend, a staff member in your department or hall of residenc","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:20.208459+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-alcohol-drugs-and-addictive-behaviours/compulsive-sexual","service_name":"Compulsive sexual behaviours and sex addiction","category":"Wellbeing","description":"Students This page covers the definitions of compulsive sexual behaviours, as well as the support and resources available to you. Compulsive sexual behaviour disorder (CSBD), sometimes called sex addiction, is an impulse control disorder defined by intense preoccupation with sexual urges, behaviours or fantasies. These urges can take up a lot of time and preoccupy your thoughts. Engaging in behaviours which cause harm to yourself or others, but feeling unable to stop, may indicate a sex addiction. Sex addiction can range from obsessive thoughts of sexual acts, to a high level of participation or engagement in sexual activity. This applies to both online and in-person activity. The short-term and long-term risks of sex addiction disorder include, but are not limited to: If you are experiencing problems relating to compulsive sexual behaviours, or know someone who is, please remember that you are not alone. You can access as a registered student. Our empathetic team can support you to fi","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:44.947504+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-alcohol-drugs-and-addictive-behaviours/eating-disorders","service_name":"Eating disorders","category":"Wellbeing","description":"Students This page covers the definitions of eating disorders as well as the support and resources available to you. An eating disorder is a mental health condition defined by abnormal eating behaviour. This disorder is an addictive behaviour which can cause serious impairment to your physical or mental health. voidant/restrictive food intake disorder (ARFID) and other specified feeding or eating disorder (OSFED). Eating disorders can be comorbid with body dysmorphic disorder (BDD), a condition defined by severe concerns about physical appearance and compulsions which disrupt your everyday life. Overconsuming or restricting your consumption of food to cope with emotions, and feeling unable to stop this behaviour, indicates an eating disorder. Eating disorders can begin as restrictive behaviour changes which lead to compulsions. The short-term and long-term risks of eating disorders include, but are not limited to: If you are experiencing problems relating to eating behaviours, or know","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:43.275650+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-alcohol-drugs-and-addictive-behaviours/gaming-disorder-video","service_name":"Gaming disorder, video game addiction and internet gaming disorder","category":"Wellbeing","description":"Students This page covers the definitions of gaming disorder, video game addiction and internet gaming disorder as well as the support and resources available to you. Gaming disorder, video game addiction and internet gaming disorder all refer to the compulsive use of video games and lack of control over gaming. This disorder can be caused by different types of gaming, such as video games, console games or internet gaming online. Gaming disorder is an addictive behaviour and characterised by regular overuse of games for hours at a time. Playing games to a level that is affecting your everyday life and relationships, but feeling unable to stop, indicates a gaming disorder. Unhealthy gaming over an extensive period of time can cause damage to both your mental and physical health. The short-term and long-term risks of gaming disorder include, but are not limited to: If you are experiencing problems relating to gaming, or know someone who is, please remember that you are not alone. You can","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:42.047191+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-alcohol-drugs-and-addictive-behaviours/internet-addiction","service_name":"Internet addiction disorder and social media addiction","category":"Wellbeing","description":"Students This page covers the definitions of internet addiction disorder, problematic internet use and pathological internet use, as well as the support and resources available to you. Internet addiction disorder is defined by a compulsive overuse of the internet and a lack of control over internet usage. This disorder encompasses use of social media platforms and websites. Compulsions to use the internet can occur on any electronic device, such as a mobile phone, laptop, tablet or PC (computer). Using the internet to a degree that is negatively impacting your everyday life, but feeling unable to stop, indicates an internet addiction disorder. Overuse of the internet and social media platforms can cause damage to both your mental and physical health. The short-term and long-term risks of internet addiction disorder include, but are not limited to: If you are experiencing problems relating to internet use, or know someone who is, please remember that you are not alone. You can access as","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:40.428653+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-alcohol-drugs-and-addictive-behaviours/pornography-addiction","service_name":"Pornography addiction","category":"Wellbeing","description":"Students This page covers the definitions of pornography addiction, as well as the support and resources available to you. Pornography addiction is an addictive behaviour defined by compulsive access and viewing of pornographic material. This includes both physical and internet pornography. Problematic pornography viewing can involve excessive viewing or accessing pornography despite any negative consequences on your personal life. Viewing pornography to avoid negative emotions, but feeling unable to stop, may indicate a pornography addiction. Overconsumption of pornography can result in psychological cravings and compulsions to access porn as a coping mechanism. The short-term and long-term risks of porn addiction disorder include, but are not limited to: If you are experiencing problems relating to pornography addiction, or know someone who is, please remember that you are not alone. You can access as a registered student. Our empathetic team can support you to find the best treatmen","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:39.409866+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-alcohol-drugs-and-addictive-behaviours/problem-gambling","service_name":"Problem gambling, gambling disorder and addiction","category":"Wellbeing","description":"Students This page covers the definitions of gambling disorder, problem gambling and addiction, as well as the support and resources available to you. Problem gambling, gambling disorder and gambling addiction all refer to repetitive and compulsive gambling behaviour. There are many types of in person and online gambling, such as gaming, EGMs (slot machines), lotteries, bingo, casino table games, poker and card games. Betting is also a type of gambling, with common bets including, but not limited to, sports events, elections, horse racing or greyhound racing. Gambling despite the harm it is causing yourself or those around you, but feeling like you are not able to stop, indicates a gambling disorder. Unhealthy engagement with gambling can range from casual gambling to compulsive gambling. The short-term and long-term risks of gambling disorder include, but are not limited to: If you are experiencing problems relating to gambling, or know someone who is, please remember that you are not","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:38.173721+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-alcohol-drugs-and-addictive-behaviours/shopping-addiction-and","service_name":"Shopping addiction and compulsive shopping","category":"Wellbeing","description":"Students This page covers the definitions of shopping addiction and compulsive shopping, as well as the support and resources available to you. Similar to compulsive buying disorder (oniomania), shopping addiction is an addictive behaviour defined by compulsive and excessive purchasing. This includes both in-person and online shopping. Compulsive shopping is characterised by a lack of impulse control when viewing and buying products. Shopping excessively to avoid negative emotions, but feeling unable to stop, indicates a shopping addiction. Spending significant time and money on shopping can be detrimental to your emotional wellbeing and personal relationships. The short-term and long-term risks of shopping addiction include, but are not limited to: If you are experiencing problems relating to shopping addiction, or know someone who is, please remember that you are not alone. You can access as a registered student. Our empathetic team can support you to find the best treatment method f","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:36.754168+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-alcohol-drugs-and-addictive-behaviours/smoking-and-vaping","service_name":"Smoking and vaping addiction","category":"Wellbeing","description":"Students This page covers the definitions of smoking and vaping addiction, as well as the support and resources available to you. Addiction to smoking or vaping refers to the compulsive desire to smoke cigarettes or use vape pens and e-cigarettes. Nicotine, a chemical derived from tobacco, is used in cigarettes, vapes and e-cigarettes. This highly addictive substance can cause nicotine dependency, meaning users can become addicted to smoking and vaping very quickly. Experiencing the need to smoke or vape to feel calmer and happier, but feeling like you can't stop, indicates a smoking and vaping addiction. Smoking addiction can have a serious impact on both your physical and psychological wellbeing.  The short-term and long-term risks of smoking addiction include, but are not limited to: Whilst the long-term physical effects of vaping are not yet known, addiction to nicotine can cause: If you are experiencing problems relating to smoking, or know someone who is, please remember that you","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:35.356579+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-alcohol-drugs-unwanted-or-addictive-behaviours","service_name":"Support for alcohol, drugs, unwanted or addictive behaviours","category":"Wellbeing","description":"Students The offers resources, education, and support to help students make informed choices and raise awareness of the risks associated with substance use and alcohol consumption, and with addictive behaviours such as gaming, gambling and pornography use. Whilst we do not condone nor normalise the use of illegal drugs or the misuse of prescription drugs, we understand that dependency and addiction is a complex health and social issue. Our Harm Reduction approach enables us to give you the resources, knowledge and support you need to stay informed and access relevant services. UCL (SSWS) can direct you to appropriate support both within and outside of UCL. The support we provide is free and available to any student enrolled at UCL You may be worried about a student at UCL and their use of alcohol, drugs or engagement with an unwanted or addictive behaviour. If this is the case, please complete a to inform Student Support and Wellbeing Services. We will always take a supportive, rather","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:32.608694+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-disabled-and-neurodivergent-students","service_name":"Support for disabled and neurodivergent students","category":"Wellbeing","description":"Students If you're joining UCL and think you might need support to access your studies, please complete our Applicant Support Questionnaire. This is available on Find out who the Disability and Neurodiversity team are, how we can support you, and what we mean by 'disability'. Find out about Reasonable Academic Adjustments for students with disabilities or a long-term health condition, this includes mental health and other neurodivergent conditions. Find out more about Specific Learning Differences (SpLDs), how to inform us of an SpLD and the support available to you. Find out about the types of funding available for disabled student support and how you can access them. Find useful resources available to you across UCL. Find relevant resources and policies that support you and allow you to participate fully in university life. Information for our Non-Medical Helpers (NMHs) and Needs Assessors. The Disability and Neurodiversity team value your feedback. If you've accessed support, please","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:07:58.829639+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-and-wellbeing/wellbeing","service_name":"Mental health and wellbeing support","category":"Wellbeing","description":"Students Student Support and Wellbeing Services do not offer emergency support. If you're in immediate danger of hurting yourself or others: If you're feeling distressed and need urgent support: Find out how we can support you within our wider team at Student Support and Wellbeing Services. Find out about the support available, both internal and external to UCL, for your mental health. Find out about the support available, both internal and external to UCL, for your wellbeing. Find out about UCL Counselling Services.","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:17.048676+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-ucl","service_name":"Support at UCL","category":"Support","description":"Students if you or someone you know is in crisis or needs urgent help please Find out how you can apply for formal support with your studies. This can include extensions, reasonable adjustments, or taking time out from your studies. Your Personal Academic Tutor will help you to get the most out of your studies, and provide support and encouragement during your time with us. Useful resources for improving your study skills. UCL’s team of wellbeing, disability and mental health staff provide expert advice that is non-judgemental. You can discuss any issues that may be affecting your ability to study in a confidential and safe space. Find out about UCL’s support, policies, training and procedures, available to students and staff, in relation to harassment and sexual misconduct affecting students. The Students’ Union UCL provides a free, confidential and independent advice service. askUCL is our self-help student enquiry system. It includes a wide range of Frequently Asked Questions. If yo","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:46.175533+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-ucl/preventing-and-addressing-harassment-and-sexual-misconduct","service_name":"Preventing and addressing harassment and sexual misconduct","category":"Events","description":"Students At UCL, we promote a positive environment in which people are treated fairly and with respect. Harassment and sexual misconduct are contrary to UCL’s ethos, values and mission and are never acceptable. No member of the UCL community is expected to tolerate such behaviour. Here, we bring together a comprehensive set of resources and detail UCL’s approach to preventing and tackling harassment and sexual misconduct. This guidance focuses in particular on incidents of harassment and sexual misconduct affecting students. 1. (advice and support) 2. 3. 4. 5. 6. 7. 8. 9. If you are in any immediate danger of harassment and/or sexual misconduct: CURRENT VERSION V1.1 - LAST UPDATED ON 26/08/25 PREVIOUS VERSIONS UCL offers support to students affected by harassment and/or sexual misconduct, and to the staff who support them. Our support is directed in different ways, depending on the issue. In this section, we set out the support pathways available to you, including when this involves st","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:50.278811+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/support-ucl/student-support-framework","service_name":"Student Support Framework","category":"Support","description":"Students UCL is committed to providing the support you need to make the most of your studies. We can help you to participate fully and stay on track whatever your personal circumstances. r simply if you need a bit of extra time to complete an assignment due to other commitments, Long-term support for students with protected characteristics such as parents, carers, key workers, those observing religious beliefs, and any student experiencing discrimination, harassment, or traumatic events such as war. If you are in immediate danger of hurting yourself or others: If you are feeling distressed and need urgent support: Further information about the support available to you can be found on our","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:49.043042+00:00"},{"source":"web","school":"ucl","url":"https://www.ucl.ac.uk/students/ucl-events-and-activities","service_name":"UCL Events and Activities","category":"Events","description":"Students Explore our options and find something new to take part in today. Students' Union UCL - sports, clubs & societies, volunteering, bars, support & wellbeing, and more For opportunities to develop your skills, gain insight into a range of different sectors and secure vacancies with top employers. In addition to events exclusively available to students, UCL also runs a programme of public events open to all. Finding your way round campus Please enable JavaScript to use this page or Enter our monthly and be in with a chance to win Amazon vouchers! Find out more from the UCL Careers team: If you would like your events or activities for UCL students included in this calendar, .","how_to_access":"See website for details.","contact":"Check website.","last_crawled_at":"2025-10-25T05:08:47.598655+00:00"}]