{"source": "web", "school": "ucl", "url": "https://www.ucl.ac.uk/careers", "last_crawled_at": "2025-10-25T04:48:07.899392+00:00", "service_name": "UCL Careers", "category": "Careers", "how_to_access": "See website for details.", "contact": "Check website.", "description": "UCL Careers Welcome to UCL Careers. We're here to help you Find your Future. About us Get one-to-one advice Come to an event Whatever you want to do in the future – whether your career path is clear or not – we are here to help you. Our team of experienced career professionals are dedicated to supporting all current UCL students, Researchers (staff and students), and recent Graduates to help you find the right path to ensure success in your future career. Exploring your options Access guidance on career choices, sector information and other routes. • Find out what our graduates do • Explore occupations and job sectors • Study, working for yourself and more! Finding your next opportunity Find relevant opportunities if you know what you're looking for. • Work opportunities and volunteering •"}
{"source": "web", "school": "ucl", "url": "https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-disabled-and-neurodivergent-students", "last_crawled_at": "2025-10-25T04:48:19.421918+00:00", "service_name": "Support for disabled and neurodivergent students", "category": "Wellbeing", "how_to_access": "cant Support Questionnaire. This is available on Portico under the Student Disability Services tab. Contact us via askUCL The support we offer Find out who the Disability and Neurodiversity team are, how we can support you, and what we mean by 'disability'. Your Reasonable Academic Adjustments Find out about", "contact": "Check website.", "description": "Support for disabled and neurodivergent students UCL is an inclusive learning environment, and we aim to enable all students to study as independently as possible during their time here. This section of our website provides information on the support available for students who are disabled or have a long-term health condition, this includes mental health and other neurodivergent conditions. YouTube Widget Placeholder https://www.youtube.com/watch?v=A5-urInK_zE Joining UCL as a disabled student If you're joining UCL and think you might need support to access your studies, please complete our Applicant Support Questionnaire. This is available on Portico under the Student Disability Services tab. Contact us via askUCL The support we offer Find out who the Disability and Neurodiversity team ar"}
{"source": "web", "school": "ucl", "url": "https://www.ucl.ac.uk/careers/about-us/get-one-one-advice", "last_crawled_at": "2025-10-25T04:48:22.229440+00:00", "service_name": "Get one-to-one advice", "category": "Careers", "how_to_access": "in ‘ Explore your options ’, ‘ Find opportunities ’ or ‘ Prepare to apply ’, and you are unable to book an appointment, we are able to answer a wide range of queries online. Please submit any questions through askUCL for initial support / advice. Alumni networking Alumni networking - UCL graduates can be a great sour", "contact": "Check website.", "description": "Get one-to-one advice Whether you're starting out with general queries, exploring options, writing applications or want support with preparing for specific interviews, our range of different appointment types will provide tailored one-to-one support. Career conversation Whether you're unsure about your future options or have something specific in mind to discuss, this type of appointment is an excellent place to get some professional advice and can be used as a starting point for discussing a wide range of topics with one of our Careers Consultants. Applications advice It is incredibly important to ensure your applications make a positive impact at every stage of your application to a job. This appointment is aimed at those who have drafted an application, (CV, cover letter, personal state"}
