{"source": "web", "school": "ucl", "type": "service", "url": "https://www.ucl.ac.uk/careers/", "name": "UCL Careers", "category": "careers", "description": "Our team of experienced career professionals are dedicated to supporting all current UCL students,  Researchers  (staff and students), and recent  Graduates   to help you find the right path to ensure success in your future career. Access guidance on career choices, sector information and other routes. •    Find out what our graduates do •    Explore occupations and job sectors •    Study, working for yourself and more! Find relevant opportunities if you know what you're looking for.  •    Work opportunities and volunteering •    Research and further study •    Funding and competitions We support you throughout the entire application process.  •    Developing your skills •    Writing CVs and applications •    Interview skills & assessment centres Funnelback feed:  https://cms-feed.ucl.ac.uk/s/search.json?collection=drupal-professional-... Double click the feed URL above to edit", "contact": {}, "last_crawled_at": "2025-10-29T15:23:18.223900+00:00"}
{"source": "web", "school": "ucl", "type": "service", "url": "https://www.ucl.ac.uk/legal-services/privacy", "name": "Privacy", "category": "support", "description": "The General Data Protection Regulation (GDPR) came into force on the 25 May 2018. UCL has designed a comprehensive Programme of work designed to deliver the changes necessary for GDPR compliance. We will continue to update this statement as the work develops and progresses. As part of our legal obligations we have published Staff, Student and General Privacy notices. Where required local privacy notices will be issued to inform individuals about what personal data is gathered, how it is used, stored and retained. UCL also has a data protection policy that sets out our commitment to the safeguarding of personal data processed by its staff and students and our stances on compliance with data protection legislation. This policy describes how UCL will discharge its duties in order to ensure compliance with the data protection principles and rights of data subjects in particular and will be updated for GDPR in due course. You can find information about the changes from the Information Commissioner's Office (ICO). The ICO is the UK regulator who oversees compliance with data protection legislation.  Information Commissioner's Office Guide to the GDPR . Further guidance on writing a privacy notice .", "contact": {}, "last_crawled_at": "2025-10-29T15:23:24.103976+00:00"}
{"source": "web", "school": "ucl", "type": "service", "url": "https://www.ucl.ac.uk/legal-services/disclaimer", "name": "Disclaimer", "category": "support", "description": "UCL has taken all reasonable care to ensure that pages published by central offices were accurate on the stated date of publication or last modification. Other pages which may be linked to the UCL home page or to other UCL pages, or which have a UCL address, may have been published by departments of UCL or other units of the College or associated with the College, or by staff or students acting entirely in a personal capacity. UCL takes no responsibility for the consequences of error or for any loss or damage suffered by users of any of the information published on any of these pages, and such information does not form any basis of a contract with readers or users of it. It is in the nature of web sites, many of which are experimental or constantly changing, that information published may be for test purposes only, may be out of date, or may be the personal opinion of the author. Readers should verify information gained from the web with the appropriate UCL authorities before relying on it. Material published by UCL central offices is copyright UCL and may not be reproduced without permission. Copyright exists in all other original material published on the web by staff or students of UCL and may belong to the author or to UCL depending on the circumstances of publication. The UCL 'dome' logo and the letters 'UCL' are the registered trade marks of UCL and may not be used without permission.", "contact": {}, "last_crawled_at": "2025-10-29T15:23:26.363796+00:00"}
{"source": "web", "school": "ucl", "type": "service", "url": "https://www.ucl.ac.uk/news/services-media", "name": "Services for media", "category": "support", "description": "UCL Media Relations team is the university's central press office. We connect journalists to academics who are experts in their field and promote UCL research and teaching throughout the global media. Check this page for all the latest data and information but if you can't find what you're looking for,  contact the UCL Media Relations Team . We manage an extensive database of UCL academics who are happy to be contacted by the media in relation to their area of research and expertise. Please use our Find an Expert service to search for a relevant academic, but  contact us  if you can't find what you're looking for. Access UCL Experts database All our current and past press releases are available online. Also, make sure you  sign up to receive future press releases .", "contact": {}, "last_crawled_at": "2025-10-29T15:23:27.672552+00:00"}
{"source": "web", "school": "ucl", "type": "service", "url": "https://www.ucl.ac.uk/careers/about-us/who-can-use-our-services/researchers", "name": "Researchers", "category": "careers", "description": "Research assistants, Research students (MRes & PhD) and, Postdoctoral research staff have access to the range of services, resources and events highlighted on the three main areas of our site:  Exploring options ,  Finding opportunities ,  Preparing to apply . As a researcher at UCL, you also have bespoke access to the following: Our specialist Careers Consultants with research backgrounds work closely with UCL’s research community to provide guidance regarding career options in academia and beyond, and support with applications. For those who have been invited to a live, telephone, skype or recorded video interview, we also offer mock interviews where you can practice with one of our team and talk through the feedback they will provide. We have a programme of Careers Consultant-led workshops on a broad range of topics, for both careers in academia and beyond academia, and also a programme of employer-led workshops, panels and networking events aimed specifically at those with a research background. Our hackathons, consultancy challenges, and exclusive internships offer hands-on ways to network with employers and gain valuable experience for your CV.", "contact": {"email": "careers@ucl.ac.uk?subject=Query%20from%20a%20Research%20Staff%20member%20about%20accessing%20myUCLCareers"}, "last_crawled_at": "2025-10-29T15:23:30.593853+00:00"}
{"source": "web", "school": "ucl", "type": "service", "url": "https://www.ucl.ac.uk/careers/about-us/upcoming-events?collection=drupal-professional-services-events&meta_UclOrgUnit=%22UCL%20Careers%22&meta_SiteName_not=%22UCL%20Careers%20for%20Employers%22&ge_DateFilter=20250923", "name": "Upcoming events", "category": "careers", "description": "Below you can find a small selection of featured events.   To view all upcoming events  that you are eligible to book onto, you will need to log into myUCLCareers to view our  full event listing / calendar  and book a place for anything you'd like to attend. Through myUCLCareers, you can also  update your profile / preferences  to subscribe to receive event alerts and be the first to know when new events are available to book. Please enable JavaScript to use this page or  visit this page for a non javascript version. Subscribe to our weekly Newsletter Funnelback feed:  https://cms-feed.ucl.ac.uk/s/search.json?collection=drupal-professional-... Double click the feed URL above to edit", "contact": {}, "last_crawled_at": "2025-10-29T15:23:31.673175+00:00"}
{"source": "web", "school": "ucl", "type": "service", "url": "https://www.ucl.ac.uk/students/support-and-wellbeing-services", "name": "Support and Wellbeing Services", "category": "wellbeing", "description": "https://mediacentral.ucl.ac.uk/Player/I9e4CEd8 Access our support and resources to address any academic and wellbeing concerns you may have. Information and advice on managing any mental health or wellbeing difficulties impacting your ability to study. Dedicated support and reasonable adjustments for students who are disabled or have a long-term health condition. Discover our wide range of health and wellbeing events you can attend throughout the year.", "contact": {}, "last_crawled_at": "2025-10-29T15:23:37.935600+00:00"}
{"source": "web", "school": "ucl", "type": "service", "url": "https://www.ucl.ac.uk/students/support-and-wellbeing-services/support-disabled-and-neurodivergent-students", "name": "Support for disabled and neurodivergent students", "category": "wellbeing", "description": "YouTube Widget Placeholder https://www.youtube.com/watch?v=A5-urInK_zE If you're joining UCL and think you might need support to access your studies, please complete our Applicant Support Questionnaire. This is available on  Portico  under the Student Disability Services tab. Contact us via askUCL Find out who the Disability and Neurodiversity team are, how we can support you, and what we mean by 'disability'.", "contact": {}, "last_crawled_at": "2025-10-29T15:23:42.376824+00:00"}
{"source": "web", "school": "ucl", "type": "service", "url": "https://www.ucl.ac.uk/students/support-and-wellbeing-services/about-us/beyond-sora-programme", "name": "Beyond the SoRA Programme", "category": "wellbeing", "description": "Below you will find information and updates from the 'Beyond the SoRA' programme. 'Beyond the SoRA' has been commissioned to assess and re-develop the Reasonable Adjustments system here at UCL. While 'Summary of Reasonable Adjustments', 'SoRAs', have now been retired, the task of addressing Reasonable Academic Adjustments continues. This programme seeks to find new technical solutions, create new policies, and establish new processes to make Reasonable Academic Adjustments more inclusive and accessible for students; enabling them to fulfill their academic potential regardless of the challenges they face. The programme will be administered via fourteen interconnecting workstreams, each with specific driving questions, workstream leads (see below), and membership drawn from UCL's academic and professional services staff. A programme board has also been created and will provide a discursive space, general programme governance, and will output reports and recommendations for the improved Reasonable Academic Adjustments system. Here you can follow along with updates from the project and access information of the workstreams and outputs from the project itself. 1/09/2025: An August programme update has been issued by the board chairs. You can access the accompanying document in the sidebar.", "contact": {"email": "beyondprogramme@ucl.ac.uk"}, "last_crawled_at": "2025-10-29T15:23:49.552926+00:00"}
