{"source": "web", "school": "ucl", "type": "program", "url": "https://www.ucl.ac.uk/prospective-students/undergraduate/degrees/computer-science-and-mathematics-meng", "title": "Computer Science and Mathematics MEng", "sections": [{"heading": "Entry Requirements", "text": "A levels IB Diploma Other qualifications Grades A*A*A Subjects A* in either Mathematics or Further Mathematics required; A levels in both Mathematics and Further Mathematics preferred. GCSEs English Language and Mathematics at grade C or 4. Contextual offer information Grades A*AB more about contextual offers Subjects Mathematics with A* required and Further Mathematics preferred. GCSEs English Language and Mathematics at grade C or 4. Points 40 Subjects A total of 20 points in three higher level subjects including grade 7 in Mathematics. The programme will accept either 'Mathematics: Analysis and Approaches' or 'Mathematics: Applications and Interpretation' at higher level. 'Mathematics: Analysis and Approaches' is preferred. Contextual offer Points 38 more about contextual offers Subjects A total of 18 points in three higher level subjects including grade 7 in Mathematics, with no higher level score below 5. The programme will accept either 'Mathematics: Analysis and Approaches' or 'Mathematics: Applications and Interpretation' at higher level. UK applicants qualifications For entry requirements with other UK qualifications accepted by UCL, choose your qualification from the list below: Select qualification Access to HE Diploma BTEC National Diploma Cambridge Pre-U Principal Subjects Scottish Advanced Highers T Levels UAL Extended Diploma Equivalent qualification Not acceptable for entrance to this programme. Not acceptable for entrance to this programme. D2,D2,D3 in three Cambridge Pre-U Principal Subjects, to include either Mathematics or Further Mathematics at D2 A1,A1,A at Advanced Highers (or A1,A1 at Advanced Higher and A,A,A at Higher), to include Mathematics at Advanced Higher A1. Not acceptable for entrance to this programme. Not acceptable for entrance to this programme. International applications Country-specific information, including details of when UCL representatives are visiting your part of the world, can be obtained from the International Student"}, {"heading": "Uk Applicants Qualifications", "text": "For entry requirements with other UK qualifications accepted by UCL, choose your qualification from the list below: Select qualification Access to HE Diploma BTEC National Diploma Cambridge Pre-U Principal Subjects Scottish Advanced Highers T Levels UAL Extended Diploma Equivalent qualification Not acceptable for entrance to this programme. Not acceptable for entrance to this programme. D2,D2,D3 in three Cambridge Pre-U Principal Subjects, to include either Mathematics or Further Mathematics at D2 A1,A1,A at Advanced Highers (or A1,A1 at Advanced Higher and A,A,A at Higher), to include Mathematics at Advanced Higher A1. Not acceptable for entrance to this programme. Not acceptable for entrance to this programme. Country-specific information, including details of when UCL representatives are visiting your part of the world, can be obtained from the International Students website . Select your country Select a country Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahrain Bangladesh Barbados Belarus Belgium Belize Bolivia Bosnia and Herzegovina Botswana Brazil Brunei Bulgaria Cambodia Cameroon Canada Caribbean / West Indies Chile China Colombia Costa Rica Croatia Cuba Cyprus (Greek Cypriot and Turkish Cypriot communities) Czech Republic Denmark Dominican Republic Ecuador Egypt El Salvador Estonia European Baccalaureate Fiji Finland France Gambia Georgia Germany Ghana Greece Guatemala Honduras Hong Kong (SAR) Hungary Iceland India Indonesia Iran Iraq Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kosovo Kuwait Latvia Lebanon Libya Liechtenstein Lithuania Luxembourg Macau (SAR) Madagascar Malawi Malaysia Malta Mauritius Mexico Moldova Montenegro Morocco Mozambique Nepal Netherlands New Zealand Nicaragua Nigeria North Macedonia Norway Oman Pakistan Panama Paraguay Peru Philippines Poland Portugal Qatar Romania Russia Saudi Arabia Serbia Singapore Slovakia Slovenia South Africa South Korea Spain Sri Lanka Sudan Swaziland Sweden Switzerland Syri"}, {"heading": "International Applications", "text": "Country-specific information, including details of when UCL representatives are visiting your part of the world, can be obtained from the International Students website . Select your country Select a country Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahrain Bangladesh Barbados Belarus Belgium Belize Bolivia Bosnia and Herzegovina Botswana Brazil Brunei Bulgaria Cambodia Cameroon Canada Caribbean / West Indies Chile China Colombia Costa Rica Croatia Cuba Cyprus (Greek Cypriot and Turkish Cypriot communities) Czech Republic Denmark Dominican Republic Ecuador Egypt El Salvador Estonia European Baccalaureate Fiji Finland France Gambia Georgia Germany Ghana Greece Guatemala Honduras Hong Kong (SAR) Hungary Iceland India Indonesia Iran Iraq Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kosovo Kuwait Latvia Lebanon Libya Liechtenstein Lithuania Luxembourg Macau (SAR) Madagascar Malawi Malaysia Malta Mauritius Mexico Moldova Montenegro Morocco Mozambique Nepal Netherlands New Zealand Nicaragua Nigeria North Macedonia Norway Oman Pakistan Panama Paraguay Peru Philippines Poland Portugal Qatar Romania Russia Saudi Arabia Serbia Singapore Slovakia Slovenia South Africa South Korea Spain Sri Lanka Sudan Swaziland Sweden Switzerland Syria Taiwan (Republic of China) Tajikistan Tanzania Thailand Trinidad and Tobago Tunisia Turkey (including Turkish sector of Cyprus) Turkmenistan Uganda Ukraine United Arab Emirates (UAE) United States of America Uruguay Uzbekistan Venezuela Vietnam Zambia Zimbabwe"}, {"heading": "Undergraduate Preparatory Certificates", "text": "The Undergraduate Preparatory Certificates (UPC) prepare international students for a UCL undergraduate degree who don’t have the qualifications to enter directly. These intensive one-year foundation courses are taught on our central London campus. Typical UPC students will be high achievers in a 12-year school system which does not meet the standard required for direct entry to UCL. For more information see: ucl.ac.uk/upc . The English language level for this programme is: Level 1"}, {"heading": "English Language Requirements", "text": "The English language level for this programme is: Level 1"}, {"heading": "Course Overview", "text": "The 4-year integrated MEng Computer Science and Mathematics at UCL will enable you to master the mathematics at the heart of all modern technology. Designed to enable skillful mathematicians to apply advanced mathematical reasoning to the analysis of computational systems, this course requires detailed study of a wide range of topics including algebra, logic, discrete mathematics, information theory and statistics. While accessing UCL Computer Science’s most mathematically complex curriculum, you’ll also study core computing modules in programming, algorithms and computer architecture. As a result, you’ll develop advanced and highly specialised skills, learning to investigate and implement theoretical methods for interacting with vast datasets – and in the process, you’ll help set a new basis for the future of computing. You’ll work closely with other students on the course, supporting each other’s learning through interactive reading groups and seminars. You'll also have ample opportunities for personal guidance from module leaders as you apply research techniques to solve practical problems. Under the close guidance of UCL’s world-leading academics, you’ll undertake a Master’s level substantive research project or dissertation in your final year. You’ll support this independent study by choosing a set of optional Master’s-level modules to build the necessary relevant expertise in specialist areas such as quantum information and communication, affective computing and human-robot interaction, or reinforcement learning."}, {"heading": "Teaching And Learning", "text": "In each year of your degree you will take a number of individual modules, normally valued at 15 or 30 credits, adding up to a total of 120 credits for the year. Modules are assessed in the academic year in which they are taken. The balance of compulsory and optional modules varies from programme to programme and year to year. A 30-credit module is considered equivalent to 15 credits in the European Credit Transfer System (ECTS). Upon successful completion of 480 credits, you will be awarded a MEng (Hons) in Computer Science and Mathematics."}, {"heading": "Modules", "text": "Please note that the list of modules given here is indicative. This information is published a long time in advance of enrolment and module content and availability is subject to change. Modules that are in use for the current academic year are linked for further information. Where no link is present, further information is not yet available. Year 1 Year 2 Year 3 Year 4 Compulsory modules Principles of Programming Theory of Computation Object-Oriented Programming Algorithms Algebra 1 Mathematical Methods 1 Algebra 2 Analysis 1 Compulsory modules Directed Reading Computer Architecture and Concurrency Logic Security Mathematical Methods 2 Probability and Statistics Algebra 3: Further Linear Algebra Optional modules Computational Methods and Programming Compulsory modules Computability and Complexity Theory Computer Science Study Abroad Optional modules Computer Graphics Group Research Project Machine Learning for Domain Specialists Quantum Computation Machine Learning for Visual Computing Biomathematics Homological Algebra Algebra 4: Groups and Rings Algebraic Topology Compilers Computer Systems Functional Programming Interaction Design Database and Information Management Systems Networked Systems Artificial Intelligence and Neural Computing Image Processing Compulsory modules Individual Project for Year 4 MEng Optional modules Supervised Learning Graphical Models Applied Machine Learning Bioinformatics Advanced Topics in Machine Learning Information Retrieval and Data Mining Statistical Natural Language Processing Reinforcement Learning Multi-agent Artificial Intelligence Machine Vision Applied Deep Learning Computational and Simulation Methods Evolutionary Games and Population Genetics Through the core curriculum of the Computer Science and Mathematics MEng, you’ll engage in a range of learning activities such as lectures, seminars, tutorials, lab sessions, workshops, demonstrations, project supervision, visits, placements and office hours . Throughout your degree, "}, {"heading": "Assessment", "text": "Your progress will be assessed through a broad range of methods, which typically include individual and group coursework, lab demonstrations and reports, individual and group projects, tests and written examinations, and oral assessments. In your final year, you’ll also be asked to produce a substantive project or dissertation. Assessment methods may vary depending on the optional and elective modules you choose. The department will endeavour to make reasonable adjustments for students with disabilities, including those with long-term health conditions, neurodivergence, learning differences and mental health conditions. This list is not exhaustive. If you're unsure of your eligibility for reasonable adjustments at UCL, please contact Student Support and Wellbeing Services ."}, {"heading": "The Foundation Of Your Career", "text": "This 4-year, integrated Master’s degree is designed to provide you with significant research experience and understanding of research methods and approaches, making it the ideal preparation for anyone interested in pursuing further postgraduate and doctoral study. The course also gives you a robust foundation for a wide range of exciting roles across many industries. Students from this course have gone onto IT analyst roles at banks in the City of London, IT specialist roles with manufacturing industries, and global IT consultancies ( UCL Graduate Outcomes Survey, 2017-2021 ). As a graduate of this course, you’ll possess a multidisciplinary combination of Master’s level mathematical and computer science knowledge and skills. You’ll have substantial experience in solving complex problems across a range of real-life scenarios and contexts. Your specialist skills and research experience will open the doors to a wide range of roles and industries, particularly those involved in research-intensive activities at innovative enterprises, leading product development, and Research & Development projects."}, {"heading": "Fees And Funding", "text": "UK students International students UK undergraduate fees for 2026/27 entry are to be confirmed and are for the first year only. Fees for subsequent years may be subject to increase: Student Terms and Conditions . UK fees are in line with the Government announcement on fee cap increases. International undergraduate students benefit from a cohort guarantee unless indicated below, meaning that their tuition fees will not increase during the course of the programme, but UCL reserves the right to increase tuition fees to reflect any sums (including levies, taxes, or similar financial charges) that UCL is required to pay any governmental authority in connection with tuition fees. International fees shown are the fees that will be charged to 2026/27 entrants."}, {"heading": "Fees For This Course", "text": "UK students International students UK undergraduate fees for 2026/27 entry are to be confirmed and are for the first year only. Fees for subsequent years may be subject to increase: Student Terms and Conditions . UK fees are in line with the Government announcement on fee cap increases. International undergraduate students benefit from a cohort guarantee unless indicated below, meaning that their tuition fees will not increase during the course of the programme, but UCL reserves the right to increase tuition fees to reflect any sums (including levies, taxes, or similar financial charges) that UCL is required to pay any governmental authority in connection with tuition fees. International fees shown are the fees that will be charged to 2026/27 entrants."}, {"heading": "Funding Your Studies", "text": "Various funding options are available, including student loans, scholarships and bursaries. UK students whose household income falls below a certain level may also be eligible for a non-repayable bursary or for certain scholarships. Please see the Fees and funding pages for more details. See all the ways you can fund your studies Funding opportunities relevant to the department may appear in this section when they are available. Please check carefully or confirm with the programme contact to ensure they apply to this degree programme and 2026/27 entry. The Scholarships and Funding website lists scholarships and funding schemes available to UCL students. These may be open to all students, or restricted to specific nationalities, regions or academic department."}, {"heading": "Scholarships", "text": "Funding opportunities relevant to the department may appear in this section when they are available. Please check carefully or confirm with the programme contact to ensure they apply to this degree programme and 2026/27 entry. The Scholarships and Funding website lists scholarships and funding schemes available to UCL students. These may be open to all students, or restricted to specific nationalities, regions or academic department."}], "last_crawled_at": "2025-10-29T15:23:27.545473+00:00"}
{"source": "web", "school": "ucl", "type": "program", "url": "https://www.ucl.ac.uk/prospective-students/graduate/taught-degrees/situated-practice-ma/2025", "title": "Situated Practice MA", "sections": [{"heading": "This Is The Programme Information For 2025/26 Entry", "text": "If you require details of this year's programme, Situated Practice MA (2026/27), click here"}, {"heading": "Entry Requirements", "text": "A minimum of a second-class UK degree in an appropriate subject or an overseas qualification of an equivalent standard. A design/creative portfolio is also expected. Applicants will be asked to submit a portfolio of their design work once their completed application has been received, and should not send or upload work until it has been requested."}, {"heading": "About This Degree", "text": "Contemporary culture doesn't fit neatly into a box. The overlap between practices, methods and approaches from the fields of architecture, art and design is the fast-evolving terrain of this programme, which examines how architecture cross-pollinates with other creative arts. Students learn about spatial theories and practices in art, architecture, performativity, urbanism and writing. They develop a robust understanding of research methods in art and design, and design practice-led research, and create their own site-related projects – from physical installations and digital interventions to site writings.  Working with practitioners and researchers from The Bartlett School of Architecture, alongside affiliated centres and institutions, this programme empowers students to pioneer new forms of hybrid practice between art and architecture. Who this course is for The programme is suited to those who aspire to work toward understanding and enlivening the environment we live in. We are looking for applications from people with multiple aims, whether you wish to gain core skills for a research degree, are in employment seeking continuing professional development or looking toward an academic career. Read about what it takes to study for a Master's at UCL What this course will give you Strong understanding of research methods: Students develop a strong understanding of appropriate research methodologies in art and design practice-led research, specifically relating to approaches towards criticality, performativity and textuality. Varied and immersive projects: Students make situated practice projects that are site-related from physical installations and events to digital interventions and site-writings. Exciting and innovative studies: The Bartlett School of Architecture helps students to prepare for successful careers in a range of fields. We aim to be an exciting and innovative place to study architecture. Our students have the opportunity to develop their creativity, c"}, {"heading": "The Foundation Of Your Career", "text": "Graduates of this programme are critical, innovative and transdisciplinary practitioners who undertake projects addressing the specific concerns of sites and developing appropriate transformations for them. 93.3% of Bartlett School of Architecture graduates were in work or further study 15 months after graduation. (Graduate Outcomes Surveys, 2017-21) Top industry sectors for Bartlett School of Architecture graduates in work are construction, built environment and property (68% of graduates); performance and creative arts (7%); academic research and higher education (6%) and technology (6%). Bartlett School of Architecture graduates are working in 52 countries around the world. The Bartlett School of Architecture is one of the world's top-ranked architecture schools and our graduates enjoy excellent employment opportunities and the practice-led research skills to carry out future doctoral research in the field."}, {"heading": "Teaching And Learning", "text": "Modules use advanced-level teaching approaches to encourage innovative student-led work. Tutorials and seminars are the leading teaching methods, together with lectures, group-working, writing workshops, research seminars, film screenings, and reviews of student work by Bartlett School of Architecture staff and visiting researchers. There are building and gallery visits in London and further afield, and an annual field trip (optional). As a project-orientated programme, all research work and design exploration culminate in an original piece of situated practice in the form of a live intervention designed for a specific site. Assessment is through documentation in a design portfolio: an artist’s book and a situated video work. In terms 1 and 2 full-time students can typically expect around 15 contact hours per teaching week through lectures, workshops and tutorials. In terms 3 and 4 (Summer term included), students will be completing their own dissertation research, keeping regular contact with their dissertation supervisors. Outside of lectures full-time students typically study the equivalent of a full-time job, using their remaining time for self-directed work and completing their final projects."}, {"heading": "Modules", "text": "Compulsory modules Critical Spatial Practice: Site-Writing Mediated Environments Situated Practice: Major Project Situated Practice: Research Methods The Open Work Please note that the list of modules given here is indicative. This information is published a long time in advance of enrolment and module content and availability are subject to change. Modules that are in use for the current academic year are linked for further information. Where no link is present, further information is not yet available. Students undertake modules to the value of 180 credits.                                            Upon successful completion of 180 credits, you will be awarded an MA in Situated Practice. Fieldwork There will be one field trip (optional) annually as part of the programme. Students will also conduct their own original spatial research into a specific site of their own choosing for their Major Project. Accessibility Details of the accessibility of UCL buildings can be obtained from AccessAble . Further information can also be obtained from the UCL Student Support and Wellbeing Services team ."}, {"heading": "Fees And Funding", "text": "UK students International students Full-time: Published fee is for the whole programme and must be paid in Year 1. No fees are charged in Year 2.. Part-time: Published fee is for half the programme and must be paid in Year 1. The other half must be paid in Year 2. No fees are charged in Year 3. Note: SLC instalments and UCL fee payment deadlines do not align. You will therefore have a shortfall in your fees to UCL. You will need to personally fund any shortfall until the remainder of your loan is paid to you by SLC. The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. For flexible/modular offer holders a £500 fee deposit will be charged."}, {"heading": "Fees For This Course", "text": "UK students International students Full-time: Published fee is for the whole programme and must be paid in Year 1. No fees are charged in Year 2.. Part-time: Published fee is for half the programme and must be paid in Year 1. The other half must be paid in Year 2. No fees are charged in Year 3. Note: SLC instalments and UCL fee payment deadlines do not align. You will therefore have a shortfall in your fees to UCL. You will need to personally fund any shortfall until the remainder of your loan is paid to you by SLC. The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. For flexible/modular offer holders a £500 fee deposit will be charged."}, {"heading": "Funding Your Studies", "text": "UCL offers a range of financial awards aimed at assisting both prospective and current students with their studies. Any additional funding available from The Bartlett School of Architecture and The Bartlett Faculty of the Built Environment are advertised on their respective websites. In our faculty, The Bartlett Promise Scholarship aims to enable students from backgrounds underrepresented in the built environment to pursue master's studies. Please see the UK Master's scholarship and Sub-Saharan Africa Master's scholarship pages for more information on eligibility criteria, selection process and FAQs. For a comprehensive list of the funding opportunities available at UCL, including funding relevant to your nationality, please visit the Scholarships and Funding website . See all the ways you can fund your studies"}, {"heading": "Contact Information", "text": "polly.gould.10@ucl.ac.uk Bartlett School of Architecture"}], "last_crawled_at": "2025-10-29T15:23:35.026756+00:00"}
{"source": "web", "school": "ucl", "type": "program", "url": "https://www.ucl.ac.uk/prospective-students/graduate/taught-degrees/creative-health-masc/2025", "title": "Creative Health MASc", "sections": [{"heading": "This Is The Programme Information For 2025/26 Entry", "text": "If you require details of this year's programme, Creative Health MASc (2026/27), click here"}, {"heading": "Entry Requirements", "text": "Normally a minimum of an upper second-class UK Bachelor's degree or an overseas qualification of an equivalent standard in psychology, medicine/biomedicine, nursing and other allied health professions, sciences, arts, liberal arts, design-related humanities and social sciences. Professional experience in the fields of arts, culture and health, or social prescribing, is desirable. An applicant whose qualifications vary from UCL standards may be admitted if evidence of an adequate academic background and work experience in an appropriate field can be shown. Intercalating MBBS/BMBS applicants are welcomed provided applicants have an undergraduate degree (2:1 minimum or equivalent) in a relevant subject. It may be possible to apply based on having completed three or four years of a medical degree programme; candidates wishing to be considered for admission in such circumstances will be considered on a case by case basis."}, {"heading": "About This Degree", "text": "The Creative Health MASc is the first of its kind, providing the first Masters level ‘Arts and Sciences’ degree, with a focus on the intersection of the arts and health sciences. The programme seeks to address growing national and international interest in the evolving field of Creative Health. It does this by examining different aspects of this field, including arts, culture and nature in health, health equity, lived experience and community assets. Our approach to teaching and learning focuses on research-led/based practice, community engagement, non-clinical interventions including social prescribing, and experiential learning. The MASc will help create a new generation of socially engaged scholars and practitioners to meet the needs of a changing health, social care and voluntary third sector, where personalised care and the patient experience are mainstreamed into primary, secondary and community health. Over the last two decades, the field of Creative Health has grown rapidly, facilitated by a number of major advances in research, several key policy documents released by Arts Councils, central government and the World Health Organisation, as well as the growing participation of arts, culture, nature and community organisations in health and wellbeing. However, the 2017 All Party Parliamentary Group for Arts, Health and Wellbeing Creative Health Inquiry has identified a need for more education and training opportunities for those interested in working in the sector. This need is particularly acute given that there are still very limited opportunities available for health and social care professionals, researchers or people from wider backgrounds interested in the field, to receive specific training, let alone an academic qualification. Moreover, this need is more pressing than ever as the world recovers from the impact of the COVID-19 Pandemic. If the field is to continue to develop and promote high-quality research and practice, the development of such trainin"}, {"heading": "The Foundation Of Your Career", "text": "The Creative Health MASc programme, which saw its first cohort of students graduate in late 2022, prepares graduates to be well placed to take up a position within health or social care, the arts, cultural and creative sectors, as well as community and local government, NGOs, and the voluntary and third sectors. Creative Health is also a growing area of research so we anticipate that graduates may enter PhD opportunities in related fields. Discover how our Alumni are shaping the future of Creative Health in the Cultural Health and Wellbeing Alliance Guest blog . Students on the Creative Health MASc will develop practical skills in the application of the range of multi- and interdisciplinary concepts, theories and methods involved in creative health, as well as designing, researching and presenting creative health research using a variety of methods and media. They will also develop a deep understanding of the intersections between research, policy and practice in relation to arts, creativity and health, and be able to critically appraise evidence from a variety of sources, along with an ability to work independently and as part of a team, including with external teams such as a community partner organisation."}, {"heading": "Teaching And Learning", "text": "The programme will involve a diversity of learning strategies. While there will be an element of traditional lectures and seminars, a significant emphasis of the core modules will be on authentic and experiential approaches to learning. Much of the content of the programme is drawn from the real-world of health and wellbeing and students will therefore be challenged to come up with practical, real-world applications of their learning. This is reflected in the large number of contributors from the health, social care, arts, creative and community sector to the degree core and in particular in the community-based nature of the dissertation module. The programme is taught with an emphasis on collaborative and co-operative learning to ensure that you enter the workforce capable of joining projects and programmes where working in teams is important. Assessment is through written assignments, projects, oral presentations, group work, and the written dissertation. For full-time students, typical contact hours are around 12-15 hours per week in the First and Second Terms and around 2-5 hours per week in the Third Term. Outside of lectures, seminars, workshops and tutorials, full-time students typically study the equivalent of a full-time job i.e. around 35 hours per week, using their remaining time for self-directed study and completing coursework assignments. Core modules are taught across the First, Second and Third Terms. Optional modules vary according to the host department, but will run in the First Second or Third Terms. The dissertation also runs across the First, Second and Third terms."}, {"heading": "Modules", "text": "Compulsory modules Dissertation Project Lived Experience in Policy, Practice and Research Research Methods in Arts and Sciences Approaches to Interdisciplinarity The Creative Health Lab Arts, Nature and Wellbeing: Non-clinical Interventions in Health Optional modules Art in the Public Sphere Health and Wellbeing in Cities: Theory and Practice Designing Inclusive Places Feminism and the Medical Self Urban Health Health Inequalities over the Lifecourse Legal and Ethical Aspects of Women's Health Philosophy, Politics and Economics of Health Community Wellbeing, Health Inequalities and the role of Social Prescribing Foundations of Citizen Science Sustainability and Decision-Making Inclusive Design and Environments Innovation for a Fairer World Find your Future Entrepreneurship: Theory and Practice East London Lab Homeless and Inclusion Health Ethnicity, Migration and Health Exploring Power, Inclusion and Exclusion with Local Communities Please note that the list of modules given here is indicative. This information is published a long time in advance of enrolment and module content and availability are subject to change. Modules that are in use for the current academic year are linked for further information. Where no link is present, further information is not yet available. Students undertake modules to the value of 180 credits.                                            Upon successful completion of 180 credits, you will be awarded an MASc in Creative Health. Upon successful completion of 120 credits, you will be awarded a PG Dip in Creative Health. Upon successful completion of 60 credits, you will be awarded a PG Cert in Creative Health. Placement Although not a formal placement, you will work with a community partner as part of the BASC0050 Dissertation Project module. During the First Term, we will provide you with a list of partner organisations and projects you can work on ﻿and you will be asked to select a number of them in order of preference. The allocation "}, {"heading": "Fees And Funding", "text": "UK students International students The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. There is no fee deposit required for PG Dip and PG Cert applicants. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Fees For This Course", "text": "UK students International students The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. There is no fee deposit required for PG Dip and PG Cert applicants. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Funding Your Studies", "text": "UCL East Scholarship The scholarship works to support the ambitions of east Londoners by funding the fees and living costs of eligible Master's programmes including this MASc at UCL. Further details are available on the UCL website . For a comprehensive list of the funding opportunities available at UCL, including funding relevant to your nationality, please visit the Scholarships and Funding website . See all the ways you can fund your studies"}, {"heading": "Contact Information", "text": "uasc-pg-admissions@ucl.ac.uk Arts and Sciences BASc"}], "last_crawled_at": "2025-10-29T15:23:36.425912+00:00"}
{"source": "web", "school": "ucl", "type": "program", "url": "https://www.ucl.ac.uk/prospective-students/graduate/taught-degrees/landscape-architecture-ma/2025", "title": "Landscape Architecture MA", "sections": [{"heading": "This Is The Programme Information For 2025/26 Entry", "text": "If you require details of this year's programme, Landscape Architecture MA (2026/27), click here"}, {"heading": "Entry Requirements", "text": "A minimum of a second-class UK degree in landscape architecture or an accredited overseas qualification in Landscape Architecture of an equivalent standard. On occasion, graduates from other degrees who can demonstrate comparable abilities will also be considered.\n\nApplicants must have also completed their previous degree and be undertaking a year in a professional practice placement or internship.\n\nA design/creative portfolio is also expected. Applicants will be asked to provide a link to a portfolio of their design work once their completed application has been received, and should not send or upload work until it has been requested."}, {"heading": "About This Degree", "text": "This accredited Master's programme allows students to progress towards a career as a Chartered Landscape Architect. Students work to put their theories into practice from week one, researching through speculative design. The programme is committed to an agenda of climate-focused landscape design and environmental stewardship, preparing students to address sustainability and deal with real-world challenges such as biodiversity loss, climate change, and ecological crises. The core priority of the Landscape Architecture MA is to equip students with the skills and knowledge needed to innovatively respond to ecological, urban, and social challenges through their work with natural and built environments. The programme is design-led, and Design Studios form a core component, giving students the opportunity to work to develop their own approach to landscape architecture. Within the Studios, tutors present unique, rigorous, challenging, and even radical intellectual positions, providing a strong identity for students working individually and in groups, and exploring real-world environments during field and site study trips. Design teaching is complemented with history and theory lectures, seminars, and readings, examining the interdependence of thought, action, and form in history, society, culture, and geography. Students refine their communication skills through seminar presentations, written work, design reviews, and exhibitions. A series of workshops and classes are available to help students gain integral skills, from planting and horticulture to digital skills and GIS. An open lecture series and film nights, amongst other extra-curricular activities, enable students to engage with the broader relationships that surround their studies. Landscape Architecture is available to study via two different pathways at The Bartlett, taught over either one or two years:"}, {"heading": "The Foundation Of Your Career", "text": "Students gain a highly specialist skill set as well as the ability to design using a range of techniques and research methods. Developing an in-depth knowledge of the discipline of landscape architecture, students will develop skills in creative problem solving, making decisions and propositions in complex, challenging, ambiguous and open-ended situations. Students will also develop skills in communicating, presenting, advocating, interrelating and responding to people from a wide variety of backgrounds within a professional context. Many graduates continue into professional practice with Landscape Architecture firms in the UK or their home country. A degree in Landscape Architecture can also lead to employment in related fields such as environmental design, landscape management and built environment policy-making as well as other design-related fields. 93.3% of Bartlett School of Architecture graduates were in work or further study 15 months after graduation (Graduate Outcomes Surveys 2017-21). Top industry sectors for Bartlett School of Architecture graduates in work are construction, built environment and property (68% of graduates); performance and creative arts (7%); academic research and higher education (6%) and technology (6%). Bartlett School of Architecture graduates are working in 52 countries around the world."}, {"heading": "Teaching And Learning", "text": "The programme is a balance of design, history and critical theory, technology, environment and practice streams and is delivered in lectures, seminars, design reviews and tutorials in group and individual teaching sessions. Students are assessed through design portfolios, essays, illustrated reports and diaries. In terms 1 and 2 students can typically expect between 17 and 20 contact hours per teaching week through lectures, workshops and tutorials. In term 3, and the summer term for Year 2 students, when most modules are complete students will be completing their major design projects, finalising portfolio production and review preparation whilst attending weekly design tutorials. Outside of lectures, students typically study the equivalent of a full-time job, using their remaining time for self-directed study and completing coursework assignments."}, {"heading": "Modules", "text": "Compulsory modules Advanced Landscape Design 1 Advanced Landscape Design 2 Landscape Architecture Theory and Practice Landscape Thesis Landscape, Ecology and Urban Environments Please note that the list of modules given here is indicative. This information is published a long time in advance of enrolment and module content and availability are subject to change. Modules that are in use for the current academic year are linked for further information. Where no link is present, further information is not yet available. Students undertake modules to the value of 180 credits.                                            Upon successful completion of 180 credits, you will be awarded an MA in Landscape Architecture. Fieldwork The programme includes an optional field trip that is taken with the design studio. This is typically a one-week trip based in a European or UK destination. Study trips are usually also the site for one or more of the design projects in the year. Accessibility Details of the accessibility of UCL buildings can be obtained from AccessAble . Further information can also be obtained from the UCL Student Support and Wellbeing Services team ."}, {"heading": "Fees And Funding", "text": "UK students International students The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Fees For This Course", "text": "UK students International students The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Funding Your Studies", "text": "UCL offers a range of financial awards aimed at assisting both prospective and current students with their studies. In our faculty, The Bartlett Promise Scholarship aims to enable students from backgrounds underrepresented in the built environment to pursue master's studies. Please see the UK Master's scholarship and Sub-Saharan Africa Master's scholarship pages for more information on eligibility criteria, selection process and FAQs. For a comprehensive list of the funding opportunities available at UCL, including funding relevant to your nationality, please visit the Scholarships and Funding website . See all the ways you can fund your studies"}, {"heading": "Contact Information", "text": "emma.colthurst.11@ucl.ac.uk Bartlett School of Architecture"}], "last_crawled_at": "2025-10-29T15:23:38.543406+00:00"}
{"source": "web", "school": "ucl", "type": "program", "url": "https://www.ucl.ac.uk/prospective-students/graduate/taught-degrees/design-manufacture/2025", "title": "Design for Manufacture MArch", "sections": [{"heading": "This Is The Programme Information For 2025/26 Entry", "text": "If you require details of this year's programme, Design for Manufacture MArch (2026/27), click here"}, {"heading": "Entry Requirements", "text": "A minimum of a second-class UK degree in an appropriate subject or an overseas qualification of an equivalent standard. Applicants with extensive experience in the field may also be considered. A design/creative portfolio is also expected. Applicants will be asked to submit a portfolio of their design work once their completed application has been received, and should not send or upload work until it has been requested."}, {"heading": "About This Degree", "text": "There is an abundance of advanced design and engineering tools in the UK that an elite workforce develops and deploys to export their expertise worldwide. Yet there is currently a shortage of skilled workers at the point of production tasked with delivering increasingly sophisticated and challenging projects by clients, in line with rising expectations of quality and regulation. This unique master’s course will expose students to new forms of advanced design and engineering methods – such as robotics and 3D scanning – that are currently reinventing core approaches to shaping, making and refitting the built and manufactured environment. Working in state-of-the-art facilities at Here East, Queen Elizabeth Olympic Park, students develop their own practice with multi-disciplinary academics, designers and practitioners. Who this course is for The programme is suitable for students who have a strong portfolio of design and/or fabrication work and wish to develop careers in design for manufacturing in the architecture, engineering and construction fields. It is also suitable for those from other disciplines involving design and making. Read about what it takes to study for a Master's at UCL What this course will give you This programme is taught by The Bartlett School of Architecture, a world-renowned architecture school for innovation and creativity, at UCL at Here East in state-of-the-art fabrication facilities. Students have access to large-volume space for 1:1 prototyping at Here East in close proximity to complimentary disciplines and expertise in civil engineering, computer science, architectural computation, environmental design and performance design. Students have the opportunity to develop, learn and innovate with advanced manufacturing processes guided by expert tutors, including robotics for fabrication and assembly, 3D printing, CNC milling, water jet, 3D scanning and laser cutting. Collaborative research, learning and working is central to the programme. With"}, {"heading": "The Foundation Of Your Career", "text": "The combination of networks, knowledge and technical expertise makes graduates of The Bartlett some of the most sought after in the world. Graduates of this programme will leave with the skills and expertise relevant to a rapidly expanding and evolving sector in industry. 93.3% of Bartlett School of Architecture graduates were in work or further study 15 months after graduation (Graduate Outcomes Surveys 2017-21). Top industry sectors for Bartlett School of Architecture graduates in work are construction, built environment and property (68% of graduates); performance and creative arts (7%); academic research and higher education (6%) and technology (6%). Bartlett School of Architecture graduates are working in 52 countries around the world. Graduates are likely to progress to further study and teaching, or roles in design and the built environment with some of the world's leading architecture, engineering and construction companies."}, {"heading": "Teaching And Learning", "text": "The programme is delivered through design and fabrication tutorials, skills workshops, seminars, lectures, site visits, group working and an (optional) field trip. Assessment is via design and skills portfolios, written coursework submissions and verbal presentations. In terms 1 and 2 full-time students can typically expect around 16 contact hours per teaching week through lectures, workshops and tutorials. In terms 3 and 4 (Summer term included), students will be completing their own dissertation research, keeping regular contact with their dissertation supervisors. Outside of lectures full-time students typically study the equivalent of a full-time job, using their remaining time for self-directed work and completing their thesis and portfolios."}, {"heading": "Modules", "text": "Compulsory modules Design for Manufacture: Introductory Design Workshops Design for Manufacture: Design Portfolio, Initial Project Design for Manufacture: Design Portfolio, Final Project Design for Manufacture: Contextual Theory Design for Manufacture: Design Thesis Report Design for Manufacture: Skills Portfolio Please note that the list of modules given here is indicative. This information is published a long time in advance of enrolment and module content and availability are subject to change. Modules that are in use for the current academic year are linked for further information. Where no link is present, further information is not yet available. Students undertake modules to the value of 180 credits.                                            Upon successful completion of 180 credits, you will be awarded an MArch in Design for Manufacture. Fieldwork The programme includes an optional field trip. Accessibility Details of the accessibility of UCL buildings can be obtained from AccessAble . Further information can also be obtained from the UCL Student Support and Wellbeing Services team ."}, {"heading": "Fees And Funding", "text": "UK students International students Full-time: Published fee is for the whole programme and must be paid in Year 1. No fees are charged in Year 2.. Part-time: Published fee is for half the programme and must be paid in Year 1. The other half must be paid in Year 2. No fees are charged in Year 3. Note: SLC instalments and UCL fee payment deadlines do not align. You will therefore have a shortfall in your fees to UCL. You will need to personally fund any shortfall until the remainder of your loan is paid to you by SLC. For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. For flexible/modular offer holders a £500 fee deposit will be charged. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Fees For This Course", "text": "UK students International students Full-time: Published fee is for the whole programme and must be paid in Year 1. No fees are charged in Year 2.. Part-time: Published fee is for half the programme and must be paid in Year 1. The other half must be paid in Year 2. No fees are charged in Year 3. Note: SLC instalments and UCL fee payment deadlines do not align. You will therefore have a shortfall in your fees to UCL. You will need to personally fund any shortfall until the remainder of your loan is paid to you by SLC. For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. For flexible/modular offer holders a £500 fee deposit will be charged. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Funding Your Studies", "text": "UCL offers a range of financial awards aimed at assisting both prospective and current students with their studies. Any additional funding available from The Bartlett School of Architecture and the Built Environment Faculty Office are advertised on the respective websites. In our faculty, The Bartlett Promise Scholarship aims to enable students from backgrounds underrepresented in the built environment to pursue master's studies. Please see the UK Master's scholarship and Sub-Saharan Africa Master's scholarship pages for more information on eligibility criteria, selection process and FAQs. For a comprehensive list of the funding opportunities available at UCL, including funding relevant to your nationality, please visit the Scholarships and Funding website . See all the ways you can fund your studies"}], "last_crawled_at": "2025-10-29T15:23:44.108263+00:00"}
{"source": "web", "school": "ucl", "type": "program", "url": "https://www.ucl.ac.uk/prospective-students/graduate/taught-degrees/architecture-and-historic-urban-environments-ma/2025", "title": "Architecture and Historic Urban Environments MA", "sections": [{"heading": "This Is The Programme Information For 2025/26 Entry", "text": "If you require details of this year's programme, Architecture and Historic Urban Environments MA (2026/27), click here"}, {"heading": "Entry Requirements", "text": "A minimum of a second-class UK degree in an appropriate subject or an overseas qualification of an equivalent standard. A design/creative portfolio is also expected. Applicants will be asked to submit a portfolio of their design work once their completed application has been received, and should not send or upload work until it has been requested."}, {"heading": "About This Degree", "text": "We are living in a time of planetary crisis. Historically, the built environment has been a major contributor to this problem, but in the future, in a world that has already largely been constructed, it must be the site of profound solutions. Championing a reparative approach to the built environment, this programme strives to achieve an urgent and radical transformation, asking students to critically engage with the past to build a better future by reinterpreting, rejuvenating, recreating and rethinking urban environments at all scales. Using London as an outstanding laboratory for learning, students are encouraged to interrogate the past through a rigorous analysis of the present, identifying and addressing historical inequities – environmentally, racially, spatially, and socially – ingrained in the urban fabric and common to all cities. Supported by an outstanding team of award-winning tutors comprising internationally renowned designers, historians and researchers, students learn innovative urban strategies and engage with key issues concerning urban and cultural heritage alongside the theory and practice of urban surveying, recording, mapping and analysis. Throughout the programme, students are encouraged to develop their own creative practice and critical voice, which are expressed fully in the production of a Final Project that responds to and reflects the programme’s aims of building equitable futures from inequitable pasts. Who this course is for This programme welcomes applications from architects, urban designers, or those in related design fields, but is also open to those who are able to demonstrate the benefits of bringing associated skills to the kinds of urban issues that are studied. In the past, this has included artists, curators, product designers, furniture makers, photographers and historians. We welcome students from all countries, especially where there are strong tensions between development pressure and retaining continuity in urban forms a"}, {"heading": "The Foundation Of Your Career", "text": "The MA equips graduates with the advanced knowledge and skills required to operate across the areas of urban research, design, management, implementation, policy and advocacy, combining subject expertise with design creativity, and linking theory, history and practice. Graduates typically pursue careers in professional practices associated with the built environment, as well as policymaking or heritage management, and academia. 93.3% of Bartlett School of Architecture graduates were in work or further study 15 months after graduation (Graduate Outcomes Surveys 2017-21). Top industry sectors for Bartlett School of Architecture graduates in work are construction, built environment and property (68% of graduates); performance and creative arts (7%); academic research and higher education (6%) and technology (6%). Bartlett School of Architecture graduates are working in 52 countries around the world. Graduates of this programme often go on to assume leading roles in varied disciplines engaged with historic and contemporary urban environments at all scales. The programme is ideally suited for graduates seeking to widen their professional practice, enhance career prospects, or embark on new career trajectories in the built environment through design, public policy or advocacy. With experience of different cities and urban conditions in a global context, graduates are highly skilled in working flexibly, collaboratively and resourcefully in different cultural, geographic and professional environments, either in the public or private sector."}, {"heading": "Teaching And Learning", "text": "The programme is delivered through a combination of lectures, seminars, practical workshops, fieldwork visits, and individual and group tutorials. Assessment is through project reviews, project portfolios, coursework essays, individual and group presentations, and a Final Project. In term 1 full-time students can typically expect between 15 and 19 contact hours per teaching week through lectures, workshops, seminars and tutorials. In term 2 students can typically study between 9 and 12 contact hours per teaching week, as with term 1, they will be a mixture of lectures, workshops, seminars and tutorials. In term 3 students will be completing their own dissertation research, keeping in regular contact with their dissertation supervisor. Outside of lectures full-time students typically study the equivalent of a full-time job, using their remaining time for self-directed study and completing coursework assignments."}, {"heading": "Modules", "text": "Compulsory modules Design Practice for Historic Environments Design Research Methods for Historic Environments Final Project Issues in Historic Urban Environments Surveying and Recording of Cities Optional modules Architecture in Britain since the 17th Century E-Merging Analysis and Design Project Histories of Global London, 1900 to the Present (I) Histories of Global London, 1900 to the Present (II) History and Theory of Digital Design Materialist Ecological Architectures Multiple Modernities Architecture Practices of Criticism Sustainable Strategies The Representation of Cities Theorising Practices: Architecture, Art and Urbanism Please note that the list of modules given here is indicative. This information is published a long time in advance of enrolment and module content and availability are subject to change. Modules that are in use for the current academic year are linked for further information. Where no link is present, further information is not yet available. Students undertake modules to the value of 180 credits.                                            Upon successful completion of 180 credits, you will be awarded an MA in Architecture and Historic Urban Environments. Fieldwork Students have the opportunity to join an annual field trip, subsidised by the school to an urban area of historic architectural interest. The field trip is designed to give students an intellectually and professionally rich experience and is planned around the deep professional connections that members of staff have with the host country/city. Previous field trips have been to the modernist UNESCO World Heritage Sites of Asmara, Eritrea and Tel Aviv, Israel, and Kaunas, Lithuania, which was European Capital of Culture in 2022."}, {"heading": "Fees And Funding", "text": "UK students International students Programme also available on a modular (flexible) basis . The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. For flexible/modular offer holders a £500 fee deposit will be charged."}, {"heading": "Fees For This Course", "text": "UK students International students Programme also available on a modular (flexible) basis . The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. For flexible/modular offer holders a £500 fee deposit will be charged."}, {"heading": "Funding Your Studies", "text": "UCL offers a range of financial awards aimed at assisting both prospective and current students with their studies. Within the faculty, the following scholarships aim to enable students from backgrounds underrepresented in the built environment to pursue master’s studies: The Bartlett Promise Master’s Scholarship This scholarship aims to enable UK-domiciled students from backgrounds underrepresented in The Bartlett, UCL’s Faculty of the Built Environment to pursue master's studies at The Bartlett. The Bartlett Promise Sub-Saharan Africa Master’s Scholarship This scholarship is open to applicants who are nationals and residents of a Bartlett approved list of Sub-Saharan African countries who have admission to a Bartlett master’s course. Read the full eligibility criteria, selection process and FAQs. For a comprehensive list of the funding opportunities available at UCL, including funding relevant to your nationality, please visit the Scholarships and Funding website . See all the ways you can fund your studies"}, {"heading": "Contact Information", "text": "jane.wong@ucl.ac.uk Bartlett School of Architecture"}], "last_crawled_at": "2025-10-29T15:23:46.742997+00:00"}
{"source": "web", "school": "ucl", "type": "program", "url": "https://www.ucl.ac.uk/prospective-students/graduate/taught-degrees/architectural-history-ma/2025", "title": "Architectural History MA", "sections": [{"heading": "This Is The Programme Information For 2025/26 Entry", "text": "If you require details of this year's programme, Architectural History MA (2026/27), click here"}, {"heading": "Entry Requirements", "text": "The normal minimum qualifications are a second-class Bachelor's degree from a UK university or an overseas qualification of an equivalent standard. Consideration will also be given if the qualification is a degree of lower than second-class Honours standard, or an equivalent overseas qualification, in a subject appropriate to the programme, plus extensive background and experience in the field. The latter implies considerable experience as a professional at a senior level. For applicants without a first degree or full professional membership, but with relevant and substantial work experience in the field, a special qualifying examination may be set. Details of this route can be obtained from the Bartlett's  Faculty Office."}, {"heading": "About This Degree", "text": "The Architectural History MA at The Bartlett School of Architecture, UCL, is the UK's longest-established degree in the historical, theoretical, and critical interpretation of architecture, cities, urban spaces, and creative practices. Since its inception in 1981, this pioneering programme has consistently evolved, emphasising the exploration of both new and existing methodologies and critical theories applied to the study of architecture and urban environments. This programme moves beyond traditional architectural studies, which often focus on the works of renowned individuals, landmark buildings, or stylistic classifications. Instead, it places architecture within a broader spectrum of social, ideological, creative, political, material, technological, theoretical, and urban processes. This comprehensive approach equips students with the tools to critically interpret buildings, texts, architects, urban spaces, cities, and various representations and creative practices from Early Modern to contemporary contexts. Who this course is for The programme is suitable for architects who are already qualified or in the process of qualification, and for graduates of other disciplines such as art history, the visual arts, history, journalism, geography or anthropology who wish to develop a specialist knowledge of architectural history or acquire a foundation for research in this field. Read about what it takes to study for a Master's at UCL What this course will give you Comprehensive Study : Delve into the architectural and urban histories from early modern periods to contemporary times, enriching your understanding of how architecture intersects with broader societal and cultural trends. Critical Interpretation: Develop a profound architectural knowledge and hone your ability to critically assess and interpret various forms of architectural and urban expressions. Expert Faculty: Learn from some of the world's most respected historians and theorists of architecture. Our facul"}, {"heading": "The Foundation Of Your Career", "text": "Postgraduate study at The Bartlett Faculty of the Built Environment is situated within a vibrant graduate and research environment, including a large cohort of PhD students and an extensive range of faculty members with interests in architectural history and theory. Students on the Architectural History MA are immersed in one of the world's largest and most innovative centres for architectural history and theory, and are able to engage in many other seminars, research networks and other events. Our graduates are highly sought after. Some choose to continue with academic research or teaching, others go on to roles in the visual arts, education, publishing, curatorship, heritage, research, design and architecture. 93.3% of Bartlett School of Architecture graduates were in work or further study 15 months after graduation. ( Graduate Outcomes Survey 2017-21) Top industry sectors for Bartlett School of Architecture graduates in work are construction, built environment and property (68% of graduates); performance and creative arts (7%); academic research and higher education (6%) and technology (6%). Bartlett School of Architecture graduates are working in 52 countries around the world."}, {"heading": "Teaching And Learning", "text": "The programme is delivered through a combination of seminars, lectures, building and gallery visits, film screenings, group working and one-to-one tutorials, and a field trip (optional). Assessment is through coursework, consisting of short exercises, classroom presentations, and longer essays for individual modules, a 10,000-word report and oral examination, and verbal presentations. In term 1, full-time students can typically expect between 10 and 14 contact hours per teaching week through lectures, workshops, seminars and tutorials. In term 2, students can typically study between 12 and 14 contact hours per teaching week, as with term 1, they will be a mixture of lectures, workshops, seminars and tutorials. In term 3, students will be completing their own dissertation research, keeping regular contact with their dissertation supervisor. Outside of lectures, full-time students typically study the equivalent of a full-time job, using their remaining time for self-directed study and completing coursework assignments.﻿"}, {"heading": "Modules", "text": "Compulsory modules Research and Dissemination of Architectural History Critical Methodologies of Architectural History Report with Oral Examination Optional modules Architecture in Britain since the 17th Century The Representation of Cities History and Theory of Digital Design Materialist Ecological Architectures Multiple Modernities Architecture Practices of Criticism Please note that the list of modules given here is indicative. This information is published a long time in advance of enrolment and module content and availability are subject to change. Modules that are in use for the current academic year are linked for further information. Where no link is present, further information is not yet available. Students undertake modules to the value of 180 credits.                                            Upon successful completion of 180 credits, you will be awarded an MA in Architectural History. Fieldwork An annual programme field trip (optional) takes place, normally in May."}, {"heading": "Fees And Funding", "text": "UK students International students Programme also available on a modular (flexible) basis . The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. For flexible/modular offer holders a £500 fee deposit will be charged."}, {"heading": "Fees For This Course", "text": "UK students International students Programme also available on a modular (flexible) basis . The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. For flexible/modular offer holders a £500 fee deposit will be charged."}, {"heading": "Funding Your Studies", "text": "UCL offers a range of financial awards aimed at assisting both prospective and current students with their studies. Any additional funding available from The Bartlett School of Architecture and the Built Environment Faculty Office are advertised on the respective websites. In our faculty, The Bartlett Promise Scholarship aims to enable students from backgrounds underrepresented in the built environment to pursue master's studies. Please see the UK Master's scholarship and Sub-Saharan Africa Master's scholarship pages for more information on eligibility criteria, selection process and FAQs. For a comprehensive list of the funding opportunities available at UCL, including funding relevant to your nationality, please visit the Scholarships and Funding website . See all the ways you can fund your studies"}], "last_crawled_at": "2025-10-29T15:23:49.428069+00:00"}
{"source": "web", "school": "ucl", "type": "program", "url": "https://www.ucl.ac.uk/prospective-students/graduate/taught-degrees/research-methods-archaeology-ma/2025", "title": "Research Methods for Archaeology MA", "sections": [{"heading": "This Is The Programme Information For 2025/26 Entry", "text": "If you require details of this year's programme, Research Methods for Archaeology MA (2026/27), click here"}, {"heading": "Entry Requirements", "text": "A minimum of an upper second-class Bachelor's degree in a relevant subject from a UK university or an overseas qualification of an equivalent standard."}, {"heading": "About This Degree", "text": "This programme offers a comprehensive and challenging introduction to theoretical issues faced by modern archaeology. Students will develop critically aware perspectives on archaeological practice and research processes. They will also gain an in-depth understanding of approaches to the collection, analysis and interpretation of data. Who this course is for The programme is aimed at students who have already chosen a research topic, but need to acquire research skills before embarking on a higher degree. Students without a clearly defined research project in mind would normally find one of the other Master's programmes at the Institute of Archaeology more suitable. Read about what it takes to study for a Master's at UCL What this course will give you UCL Institute of Archaeology is one of the largest centres for archaeology in Britain and ranked 3rd in the QS World Rankings by Subject 2024. It brings archaeology, cultural heritage, and museum studies together under one roof, making it a special and exciting place to study. This programme offers you many benefits and opportunities: Learn from leading experts in their fields. Use of the Institute’s exceptional laboratories, equipment, archives, and teaching collections. Proximity to British Museum and British Library, as well as UCL’s Petrie Museum of Egyptian Archaeology. Read about what you'll get out of a graduate programme"}, {"heading": "The Foundation Of Your Career", "text": "Upon completion of this degree, students have skills well suited for jobs in sectors such as: Archaeology within Higher Education, museums, and private companies Environmental and sustainability sector Journalism Civil Service Tourism and heritage management “My time at the Institute of Archaeology was invaluable. Being global in focus and nature truly refined my thinking and prepared me well to overcome the challenges that I encountered as part of my professional career.” - Laurence Maidment- Blundell (PhD Student) The programme is designed to enhance career prospects by giving students transferable skills attractive to employers in a wide range of businesses and sectors, such as: Theoretical and critical analysis. Ability to design and carry out original research. Practical archaeological skills."}, {"heading": "Teaching And Learning", "text": "The two theory core courses each involve two contact hours per week during the teaching weeks. Skills courses will also involve a number of contact hours, depending on what is chosen. Students will also have regular meetings with their supervisor. However, the vast majority of the time on this degree will be spent in self-study, following a programme agreed with the supervisor. The core programme is taught within a seminar framework based on set readings. A tailor-made programme of other work is designed in consultation with the student's research supervisor. Student performance is assessed on the basis of the core module assessments, a research proposal and a piece of research writing (dissertation). The contact hours per module are normally around 2-3 hours a week with additional self-directed study time. The two theory core courses each involve two contact hours per week during the teaching weeks. Skills courses will also involve a number of contact hours, depending on what is chosen. Outside of lectures, seminars, workshops, and tutorials, full-time students typically study the equivalent of a full-time job, using their remaining time for self-directed study and completing coursework assignments.  Students will also have regular meetings with their supervisor. However, the vast majority of the time on this degree will be spent in self-study, following a programme agreed with the supervisor."}, {"heading": "Modules", "text": "Compulsory modules Portfolio of Coursework Research Proposal Piece of Research Writing Please note that the list of modules given here is indicative. This information is published a long time in advance of enrolment and module content and availability are subject to change. Modules that are in use for the current academic year are linked for further information. Where no link is present, further information is not yet available. Students undertake modules to the value of 180 credits.                                            Upon successful completion of 180 credits, you will be awarded an MA in Research Methods for Archaeology. Accessibility Details of the accessibility of UCL buildings can be obtained from AccessAble . Further information can also be obtained from the UCL Student Support and Wellbeing Services team ."}, {"heading": "Fees And Funding", "text": "UK students International students The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Fees For This Course", "text": "UK students International students The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Funding Your Studies", "text": "Institute of Archaeology Master's Awards : The UCL Institute of Archaeology has one studentship of £10,000 available to support a graduate student who is an ordinarily resident in the UK or Ireland and eligible to pay home fee rate. The deadline for applications is 1st March 2025. For further information and to download an application see here . For a comprehensive list of the funding opportunities available at UCL, including funding relevant to your nationality, please visit the Scholarships and Funding website . See all the ways you can fund your studies"}], "last_crawled_at": "2025-10-29T15:23:52.161623+00:00"}
{"source": "web", "school": "ucl", "type": "program", "url": "https://www.ucl.ac.uk/prospective-students/graduate/taught-degrees/principles-conservation-ma/2025", "title": "Principles of Conservation MA", "sections": [{"heading": "This Is The Programme Information For 2025/26 Entry", "text": "If you require details of this year's programme, Principles of Conservation MA (2026/27), click here"}, {"heading": "Entry Requirements", "text": "A minimum of an upper second-class Bachelor's degree normally in archaeology, anthropology, history of art or the physical sciences from a UK university or an overseas qualification of an equivalent standard. Degrees in other subjects may be accepted, and relevant experience (e.g. in conservation, archaeology or museums) is an advantage. Applicants should also have gained experience of working in the heritage sector (this experience is often gained in a voluntary capacity)"}, {"heading": "About This Degree", "text": "This MA will give you knowledge and skills to work in several conservation contexts and cross-disciplines. Our object-based approaches are grounded in real problems that generate both practical and theoretical responses. Students will gain extensive experience using UCL collections throughout their studies. On this programme you will learn about: Approaches to collection care and conservation strategies. Understanding of raw materials and manufacturing technologies. Care and management of collections. Ethics of conservation and cultural heritage. Professional practice and research processes. Who this course is for The programme is designed for students with experience in: Heritage. Anthropology. Archaeology. Culture and/or fine arts. Ideally, you should have some experience in the heritage/museum sector either paid or voluntary. Although the programme does not provide practical training in interventive conservation treatments, it is an excellent preparation for scientists wishing to undertake research in conservation science. It is also suitable for those considering a career in collection care, preventive conservation and management. The programme is a prerequisite for the two-year MSc in Conservation for Archaeology and Museums. Read about what it takes to study for a Master's at UCL"}, {"heading": "The Foundation Of Your Career", "text": "The UCL Institute of Archaeology has a long history of training in conservation, and many of its graduates are now employed in key posts around the world. Upon completing this degree, you will also have skills well suited for jobs in sectors such as: Museums, galleries and private conservation companies. Sustainable heritage Heritage journalism. Tourism and heritage management. “My time at the Institute of Archaeology was invaluable. Being global in focus and nature truly refined my thinking and prepared me well to overcome the challenges that I encountered as part of my professional career.” - Laurence Maidment- Blundell (PhD Student) The programme is designed to enhance career prospects by giving students transferable skills attractive to employers in a wide range of businesses and sectors, such as:"}, {"heading": "Teaching And Learning", "text": "The programme is delivered through a combination of seminars, lectures, small-group tutorials, workshops and practical projects. Some modules include visits to conservation workshops and museums, including the British Museum, the British Library, Natural History Museum, and Tate galleries. Assessment is through coursework, essays, poster, portfolio, project reports and the dissertation. Contact time takes various forms: Lectures. Seminars. Project supervisions. Visits and placements. Assessment feedback sessions."}, {"heading": "Modules", "text": "Compulsory modules Dissertation Skills for Conservation Management Preventive Conservation Conservation in Cross-Disciplinary Contexts Investigating and Understanding Objects Optional modules Archaeometallurgy I: Mining and Extractive Metallurgy Interpreting Pottery Archaeological Ceramic Analysis Cultural Memory Digital Heritage: Applications in Heritage Management Prehistoric Stone Artefact Analysis Managing Archaeological Sites Please note that the list of modules given here is indicative. This information is published a long time in advance of enrolment and module content and availability are subject to change. Modules that are in use for the current academic year are linked for further information. Where no link is present, further information is not yet available. Students undertake modules to the value of 180 credits.                                            Upon successful completion of 180 credits, you will be awarded an MA in Principles of Conservation. Accessibility Details of the accessibility of UCL buildings can be obtained from AccessAble . Further information can also be obtained from the UCL Student Support and Wellbeing Services team ."}, {"heading": "Fees And Funding", "text": "UK students International students The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Fees For This Course", "text": "UK students International students The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Funding Your Studies", "text": "Heritage and Museums Diversity Scholarship : The UCL Institute of Archaeology is funding a scholarship for a candidate from Black British, British Pakistani or British Bangladeshi backgrounds as these groups are currently under-represented within the heritage sector. The scholarship covers course fees only for a Home student. For further details and an application form please see here . Institute of Archaeology Master's Awards : The UCL Institute of Archaeology has one studentship of £10,000 available to support a graduate student who is an ordinarily resident in the UK or Ireland and eligible to pay home fee rate. The deadline for applications is 1st March 2025. For further information and to download an application see here . UK students may also apply to the Anna Plowden Trust . For a comprehensive list of the funding opportunities available at UCL, including funding relevant to your nationality, please visit the Scholarships and Funding website . See all the ways you can fund your studies"}], "last_crawled_at": "2025-10-29T15:23:55.606050+00:00"}
{"source": "web", "school": "ucl", "type": "program", "url": "https://www.ucl.ac.uk/prospective-students/graduate/taught-degrees/museum-studies-ma/2025", "title": "Museum Studies MA", "sections": [{"heading": "This Is The Programme Information For 2025/26 Entry", "text": "If you require details of this year's programme, Museum Studies MA (2026/27), click here"}, {"heading": "Entry Requirements", "text": "A minimum of an upper second-class Bachelor's degree in a relevant subject from a UK university or an overseas qualification of an equivalent standard. Applicants should also have gained experience of working in museums or related organisations (this experience is often gained in a voluntary capacity)."}, {"heading": "About This Degree", "text": "The programme will equip you with the knowledge and skills required to become a museum professional. You will be taught by experts in museum, archives, and collections. You will be able to get hands-on experience through your 20 days work placement. Recent placements have included: The British Museum London Transport Museum RAF Museums Royal Academy Royal Historical Palaces Who this course is for The programme is ideal for those wishing to enter the museum profession or pursue PhD studies on museological topics. It provides a balance of practice and theory for students from a wide range of academic backgrounds and cultures. Read about what it takes to study for a Master's at UCL"}, {"heading": "The Foundation Of Your Career", "text": "Upon completing this degree, you will have skills well suited for jobs in sectors such as: Tourism and heritage management. Collections management and visitor/community engagement work  within HE, museums, and private companies. Environmental and sustainability sector. Journalism. Civil Service. “My time at the Institute of Archaeology was invaluable. Being global in focus and nature truly refined my thinking and prepared me well to overcome the challenges that I encountered as part of my professional career.” - Laurence Maidment- Blundell (PhD Student) On completion of this programme, you will have gained practical skills relevant to the Museum and Heritage sector: Collections care procedures. Packing and storing objects. Collections-based research. Exhibition proposal development. Visitor evaluation Policy and funding development"}, {"heading": "Teaching And Learning", "text": "The programme is delivered through lectures, small group seminars, practical workshops, student-led panel meetings, museum visits and guest speakers. Students are required to undertake a work placement for a total of 20 days. Assessment is through coursework assignments, projects, essays, field reports, portfolio and the dissertation. Contact time takes various forms: Lectures. Seminars. Practical workshops. Project supervision. Museum visits and placements. Assessment feedback sessions."}, {"heading": "Modules", "text": "Compulsory modules Dissertation The Museum: Critical Perspectives Managing Museums Collections Management and Care Museum Communication and Audience Engagement Museum Studies Placement Optional modules Collections Curatorship Heritage Ethics and Archaeological Practice in the Middle East and Mediterranean Exhibition Project Oral History: Creation to Curation Please note that the list of modules given here is indicative. This information is published a long time in advance of enrolment and module content and availability are subject to change. Modules that are in use for the current academic year are linked for further information. Where no link is present, further information is not yet available. Students undertake modules to the value of 180 credits.                                            Upon successful completion of 180 credits, you will be awarded an MA in Museum Studies. Placement Students are required to undertake 20 days’ work placement in a museum or similar organisation. This usually takes place one day a week during term-time, although other arrangements may be possible. Students create and present a poster at the end of the placement reflecting on their experience. The Institute will support you with your application and help you find an organisation that matches your interests. In recent years placements have included organisations such as: the British Museum. Royal Botanical Gardens Kew. Royal Historic Palaces. Royal Academy. Museum of London. St Paul’s Cathedral. RAF Museums. For any queries regarding the placement please contact Prof Theano Moussouri ."}, {"heading": "Fees And Funding", "text": "UK students International students The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Fees For This Course", "text": "UK students International students The tuition fees shown are for the year indicated above. Fees for subsequent years may increase or otherwise vary. Where the programme is offered on a flexible/modular basis, fees are charged pro-rata to the appropriate full-time Master's fee taken in an academic session. Further information on fee status, fee increases and the fee schedule can be viewed on the UCL Students website: ucl.ac.uk/students/fees . For Full-time and Part-time offer holders a fee deposit will be charged at 10% of the first year fee. Further information can be found in the Tuition fee deposits section on this page: Tuition fees ."}, {"heading": "Funding Your Studies", "text": "Heritage and Museums Diversity Scholarship : The UCL Institute of Archaeology is funding a scholarship for a candidate from Black British, British Pakistani or British Bangladeshi backgrounds as these groups are currently under-represented within the heritage sector. The scholarship covers course fees only for a Home student. For further details and an application form please see here . Institute of Archaeology Master's Awards : The UCL Institute of Archaeology has one studentship of £10,000 available to support a graduate student who is an ordinarily resident in the UK or Ireland and eligible to pay home fee rate. The deadline for applications is 1st March 2025. For further information and to download an application see here . For a comprehensive list of the funding opportunities available at UCL, including funding relevant to your nationality, please visit the Scholarships and Funding website . See all the ways you can fund your studies"}], "last_crawled_at": "2025-10-29T15:23:57.366101+00:00"}
